{
  "AssistedGamelist": {
    "FR": "AssistedGamelist utilise l'Intelligence Artificielle pour compléter les descriptions manquantes de vos jeux.\n\nFonctionnalités :\n- Analyse Intelligente : Détecte automatiquement les jeux sans description dans vos fichiers gamelist.xml.\n- Génération IA : Interroge des modèles performants (Gemini, GPT) pour rédiger des synopsis précis.\n- Sécurité des Données : Fusionne les nouvelles informations sans écraser vos chemins d'images ou configurations existantes.\n- Personnalisable : Permet de définir des instructions spécifiques pour guider l'IA.\n\nUtilisation :\n1. Sélectionnez votre fichier 'gamelist.xml'.\n2. (Optionnel) Chargez un fichier d'instructions personnalisées.\n3. Configurez l'accès API (URL, Modèle, Clé).\n4. Cliquez sur 'Démarrer' pour lancer l'analyse et la génération.",
    "EN": "AssistedGamelist uses Artificial Intelligence to complete missing descriptions for your games.\n\nFeatures:\n- Intelligent Analysis: Automatically detects games without descriptions in your gamelist.xml files.\n- AI Generation: Queries high-performance models (Gemini, GPT) to write precise synopses.\n- Data Safety: Merges new information without overwriting your existing image paths or configurations.\n- Customizable: Allows defining specific instructions to guide the AI.\n\nUsage:\n1. Select your 'gamelist.xml' file.\n2. (Optional) Load a custom instructions file.\n3. Configure API access (URL, Model, Key).\n4. Click 'Start' to launch analysis and generation.",
    "DE": "AssistedGamelist nutzt künstliche Intelligenz, um fehlende Beschreibungen Ihrer Spiele zu vervollständigen.\n\nFunktionen:\n- Intelligente Analyse: Erkennt automatisch Spiele ohne Beschreibung in Ihren gamelist.xml-Dateien.\n- KI-Generierung: Fragt leistungsstarke Modelle (Gemini, GPT) ab, um präzise Zusammenfassungen zu verfassen.\n- Datensicherheit: Führt neue Informationen zusammen, ohne Ihre bestehenden Bildpfade oder Konfigurationen zu überschreiben.\n- Anpassbar: Ermöglicht das Definieren spezifischer Anweisungen, um die KI zu leiten.\n\nVerwendung:\n1. Wählen Sie Ihre 'gamelist.xml'-Datei aus.\n2. (Optional) Laden Sie eine Datei mit benutzerdefinierten Anweisungen.\n3. Konfigurieren Sie den API-Zugriff (URL, Modell, Schlüssel).\n4. Klicken auf 'Starten', um die Analyse und Generierung zu starten.",
    "ES": "AssistedGamelist utiliza Inteligencia Artificial para completar las descripciones faltantes de tus juegos.\n\nFuncionalidades:\n- Análisis Inteligente: Detecta automáticamente los juegos sin descripción en tus archivos gamelist.xml.\n- Generación IA: Consulta modelos potentes (Gemini, GPT) para redactar sinopsis precisas.\n- Seguridad de Datos: Fusiona la nueva información sin sobrescribir tus rutas de imágenes o configuraciones existentes.\n- Personalizable: Permite definir instrucciones específicas para guiar a la IA.\n\nUso:\n1. Selecciona tu archivo 'gamelist.xml'.\n2. (Opcional) Carga un archivo de instrucciones personalizadas.\n3. Configura el acceso API (URL, Modelo, Clave).\n4. Haz clic en 'Iniciar' para lanzar el análisis y la generación.",
    "IT": "AssistedGamelist utilizza l'Intelligenza Artificiale per completare le descrizioni mancanti dei tuoi giochi.\n\nFunzionalità:\n- Analisi Intelligente: Rileva automaticamente i giochi senza descrizione nei tuoi file gamelist.xml.\n- Generazione IA: Interroga modelli performanti (Gemini, GPT) per redigere sinossi precise.\n- Sicurezza dei Dati: Unisce le nuove informazioni senza sovrascrivere i tuoi percorsi immagini o configurazioni esistenti.\n- Personalizzabile: Permette di definire istruzioni specifiche per guidare l'IA.\n\nUso:\n1. Seleziona il tuo file 'gamelist.xml'.\n2. (Opzionale) Carica un file di istruzioni personalizzate.\n3. Configura l'accesso API (URL, Modello, Chiave).\n4. Clicca su 'Avvia' per lanciare l'analisi e la generazione.",
    "PT": "AssistedGamelist utiliza Inteligência Artificial para completar as descrições em falta dos seus jogos.\n\nFuncionalidades:\n- Análise Inteligente: Deteta automaticamente jogos sem descrição nos seus ficheiros gamelist.xml.\n- Geração IA: Consulta modelos de alto desempenho (Gemini, GPT) para redigir sinopses precisas.\n- Segurança de Dados: Funde novas informações sem sobrescrever os seus caminhos de imagens ou configurações existentes.\n- Personalizável: Permite definir instruções específicas para guiar a IA.\n\nUtilização:\n1. Selecione o seu ficheiro 'gamelist.xml'.\n2. (Opcional) Carregue um ficheiro de instruções personalizadas.\n3. Configure o acesso API (URL, Modelo, Chave).\n4. Clique em 'Iniciar' para lançar a análise e geração."
  },
  "BGBackup": {
    "FR": "BGBackup est votre assurance-vie pour ne jamais perdre vos métadonnées durement acquises.\n\nFonctionnalités :\n- Sauvegarde Ciblée : Recherche récursivement tous les fichiers 'gamelist.xml' dans votre dossier de jeux.\n- Archivage Léger : Crée un fichier ZIP contenant uniquement vos listes, sans les médias volumineux.\n- Sécurité : Idéal pour sauvegarder votre travail de scraping avant de tester de nouveaux outils ou configurations.\n- Autonome : Télécharge et utilise 7-Zip automatiquement pour une compression efficace.\n\nUtilisation :\n1. Dossier ROMS (Source) : Indiquez le dossier racine où sont stockés vos jeux.\n2. Dossier Backup (Destination) : Choisissez où l'archive de sauvegarde sera créée.\n3. Cliquez sur 'CRÉER LE BACKUP' pour lancer le scan et la compression.",
    "EN": "BGBackup is your life insurance to never lose your hard-earned metadata.\n\nFeatures:\n- Targeted Backup: Recursively searches for all 'gamelist.xml' files in your game folder.\n- Lightweight Archiving: Creates a ZIP file containing only your lists, without bulky media.\n- Safety: Ideal for backing up your scraping work before testing new tools or configurations.\n- Autonomous: Automatically downloads and uses 7-Zip for efficient compression.\n\nUsage:\n1. ROMS Folder (Source): Indicate the root folder where your games are stored.\n2. Backup Folder (Destination): Choose where the backup archive will be created.\n3. Click 'CREATE BACKUP' to start scanning and compression.",
    "DE": "BGBackup ist Ihre Lebensversicherung, um Ihre hart erarbeiteten Metadaten niemals zu verlieren.\n\nFunktionen:\n- Gezielte Sicherung: Sucht rekursiv nach allen 'gamelist.xml'-Dateien in Ihrem Spieleordner.\n- Leichte Archivierung: Erstellt eine ZIP-Datei, die nur Ihre Listen enthält, ohne sperrige Medien.\n- Sicherheit: Ideal, um Ihre Scraping-Arbeit zu sichern, bevor Sie neue Tools oder Konfigurationen testen.\n- Autonom: Lädt 7-Zip automatisch herunter und verwendet es für eine effiziente Komprimierung.\n\nVerwendung:\n1. ROMS-Ordner (Quelle): Geben Sie den Stammordner an, in dem Ihre Spiele gespeichert sind.\n2. Backup-Ordner (Ziel): Wählen Sie, wo das Sicherungsarchiv erstellt werden soll.\n3. Klicken Sie auf 'BACKUP ERSTELLEN', um den Scan und die Komprimierung zu starten.",
    "ES": "BGBackup es tu seguro de vida para no perder nunca tus metadatos duramente conseguidos.\n\nFuncionalidades:\n- Copia de Seguridad Dirigida: Busca recursivamente todos los archivos 'gamelist.xml' en tu carpeta de juegos.\n- Archivado Ligero: Crea un archivo ZIP conteniendo solo tus listas, sin los medios voluminosos.\n- Seguridad: Ideal para guardar tu trabajo de scraping antes de probar nuevas herramientas o configuraciones.\n- Autónomo: Descarga y utiliza 7-Zip automáticamente para una compresión eficaz.\n\nUso:\n1. Carpeta ROMS (Fuente): Indica la carpeta raíz donde están almacenados tus juegos.\n2. Carpeta Backup (Destino): Elige dónde se creará el archivo de copia de seguridad.\n3. Haz clic en 'CREAR BACKUP' para iniciar el escaneo y la compresión.",
    "IT": "BGBackup è la tua assicurazione sulla vita per non perdere mai i tuoi metadati duramente acquisiti.\n\nFunzionalità:\n- Backup Mirato: Cerca ricorsivamente tutti i file 'gamelist.xml' nella tua cartella di giochi.\n- Archiviazione Leggera: Crea un file ZIP contenente solo le tue liste, senza i media voluminosi.\n- Sicurezza: Ideale per salvare il tuo lavoro di scraping prima di testare nuovi strumenti o configurazioni.\n- Autonomo: Scarica e utilizza automaticamente 7-Zip per una compressione efficiente.\n\nUso:\n1. Cartella ROMS (Sorgente): Indica la cartella radice dove sono memorizzati i tuoi giochi.\n2. Cartella Backup (Destinazione): Scegli dove verrà creato l'archivio di backup.\n3. Clicca su 'CREA BACKUP' per avviare la scansione e la compressione.",
    "PT": "BGBackup é o seu seguro de vida para nunca perder os seus metadados duramente adquiridos.\n\nFuncionalidades:\n- Backup Direcionado: Pesquisa recursivamente todos os ficheiros 'gamelist.xml' na sua pasta de jogos.\n- Arquivo Leve: Cria um ficheiro ZIP contendo apenas as suas listas, sem os ficheiros multimédia volumosos.\n- Segurança: Ideal para salvaguardar o seu trabalho de scraping antes de testar novas ferramentas ou configurações.\n- Autónomo: Descarrega e utiliza automaticamente o 7-Zip para uma compressão eficiente.\n\nUtilização:\n1. Pasta ROMS (Fonte): Indique a pasta raiz onde os seus jogos estão armazenados.\n2. Pasta Backup (Destino): Escolha onde o arquivo de backup será criado.\n3. Clique em 'CRIAR BACKUP' para iniciar a verificação e compressão."
  },
  "CBZKiller": {
    "FR": "CBZKiller standardise votre collection de BD et mangas numériques au format CBZ.\n\nFonctionnalités :\n- Conversion Massive : Transforme vos fichiers PDF et CBR en CBZ, format optimal pour liseuses.\n- Traitement par Lot : Convertit des dossiers entiers de manière récursive.\n- Nettoyage Automatique : Option pour supprimer les fichiers originaux après une conversion réussie.\n- Préservation Qualité : Conserve la qualité optimale des images extraites.\n\nUtilisation :\n1. Cliquez sur 'Sélectionner Dossier' pour choisir la source.\n2. Cochez 'Suppr. originaux après' si vous souhaitez remplacer les fichiers.\n3. Cliquez sur 'CONVERTIR' pour lancer le traitement.",
    "EN": "CBZKiller standardizes your digital comic and manga collection to CBZ format.\n\nFeatures:\n- Mass Conversion: Transforms your PDF and CBR files into CBZ, the optimal format for e-readers.\n- Batch Processing: Converts entire folders recursively.\n- Auto Cleanup: Option to delete original files after successful conversion.\n- Quality Preservation: Maintains optimal quality of extracted images.\n\nUsage:\n1. Click 'Select Folder' to choose the source.\n2. Check 'Delete originals after' if you want to replace files.\n3. Click 'CONVERT' to start processing.",
    "DE": "CBZKiller standardisiert Ihre digitale Comic- und Manga-Sammlung im CBZ-Format.\n\nFunktionen:\n- Massenkonvertierung: Wandelt Ihre PDF- und CBR-Dateien in CBZ um, das optimale Format für E-Reader.\n- Stapelverarbeitung: Konvertiert ganze Ordner rekursiv.\n- Automatische Bereinigung: Option zum Löschen der Originaldateien nach erfolgreicher Konvertierung.\n- Qualitätserhaltung: Behält die optimale Qualität der extrahierten Bilder bei.\n\nVerwendung:\n1. Klicken Sie auf 'Ordner auswählen', um die Quelle zu wählen.\n2. Aktivieren Sie 'Originale danach löschen', wenn Sie Dateien ersetzen möchten.\n3. Klicken Sie auf 'KONVERTIEREN', um die Verarbeitung zu starten.",
    "ES": "CBZKiller estandariza tu colección de cómics y mangas digitales al formato CBZ.\n\nFuncionalidades:\n- Conversión Masiva: Transforma tus archivos PDF y CBR en CBZ, el formato óptimo para libros electrónicos.\n- Procesamiento por Lotes: Convierte carpetas enteras de forma recursiva.\n- Limpieza Automática: Opción para eliminar los archivos originales tras una conversión exitosa.\n- Preservación de Calidad: Mantiene la calidad óptima de las imágenes extraídas.\n\nUso:\n1. Haz clic en 'Seleccionar Carpeta' para elegir la fuente.\n2. Marca 'Eliminar originales después' si deseas reemplazar los archivos.\n3. Haz clic en 'CONVERTIR' para iniciar el procesamiento.",
    "IT": "CBZKiller standardizza la tua collezione di fumetti e manga digitali nel formato CBZ.\n\nFunzionalità:\n- Conversione Massiva: Trasforma i tuoi file PDF e CBR in CBZ, il formato ottimale per e-reader.\n- Elaborazione in Batch: Converte intere cartelle in modo ricorsivo.\n- Pulizia Automatica: Opzione per eliminare i file originali dopo una conversione riuscita.\n- Preservazione Qualità: Mantiene la qualità ottimale delle immagini estratte.\n\nUso:\n1. Clicca su 'Seleziona Cartella' per scegliere la sorgente.\n2. Spunta 'Elimina originali dopo' se desideri sostituire i file.\n3. Clicca su 'CONVERTI' per avviare l'elaborazione.",
    "PT": "CBZKiller normaliza a sua coleção de banda desenhada e manga digital para o formato CBZ.\n\nFuncionalidades:\n- Conversão em Massa: Transforma os seus ficheiros PDF e CBR em CBZ, o formato ideal para leitores eletrónicos.\n- Processamento por Lote: Converte pastas inteiras de forma recursiva.\n- Limpeza Automática: Opção para eliminar os ficheiros originais após uma conversão bem-sucedida.\n- Preservação de Qualidade: Mantém a qualidade ideal das imagens extraídas.\n\nUtilização:\n1. Clique em 'Selecionar Pasta' para escolher a fonte.\n2. Marque 'Eliminar originais depois' se desejar substituir os ficheiros.\n3. Clique em 'CONVERTER' para iniciar o processamento."
  },
  "CHDManager": {
    "FR": "CHDManager est l'outil ultime pour compresser vos jeux CD (PS1, Dreamcast, Saturn...) au format CHD.\n\nFonctionnalités :\n- Compression Performante : Convertit ISO, GDI, CUE vers CHD pour gagner jusqu'à 60% d'espace.\n- Multi-Thread : Utilise tous les cœurs de votre processeur pour une vitesse maximale.\n- Interface Complète : Permet de convertir (Vers CHD), extraire (Vers CUE/BIN), vérifier ou obtenir des infos sur vos images.\n- Gestion Automatique : Télécharge 'chdman' automatiquement si nécessaire et gère les archives (ZIP/7Z) en entrée.\n\nUtilisation :\n1. Sélectionnez les dossiers Source et Destination.\n2. Choisissez le mode : Info, Vérifier, Convertir ou Extraire.\n3. Ajustez le nombre de cœurs CPU (Threads) selon votre machine.\n4. Cliquez sur 'Démarrer' pour lancer le traitement.",
    "EN": "CHDManager is the ultimate tool to compress your CD games (PS1, Dreamcast, Saturn...) to CHD format.\n\nFeatures:\n- High Performance Compression: Converts ISO, GDI, CUE to CHD to save up to 60% space.\n- Multi-Thread: Uses all your processor cores for maximum speed.\n- Complete Interface: Allows converting (To CHD), extracting (To CUE/BIN), verifying, or getting info on your images.\n- Automated Management: Automatically downloads 'chdman' if needed and handles archives (ZIP/7Z) as input.\n\nUsage:\n1. Select Source and Destination folders.\n2. Choose mode: Info, Verify, Convert, or Extract.\n3. Adjust the number of CPU cores (Threads) according to your machine.\n4. Click 'Start' to launch processing.",
    "DE": "CHDManager ist das ultimative Tool, um Ihre CD-Spiele (PS1, Dreamcast, Saturn...) im CHD-Format zu komprimieren.\n\nFunktionen:\n- Hochleistungskomprimierung: Konvertiert ISO, GDI, CUE zu CHD, um bis zu 60% Platz zu sparen.\n- Multi-Thread: Nutzt alle Prozessorkerne für maximale Geschwindigkeit.\n- Vollständige Oberfläche: Ermöglicht das Konvertieren (zu CHD), Extrahieren (zu CUE/BIN), Überprüfen oder Abrufen von Infos zu Ihren Images.\n- Automatische Verwaltung: Lädt bei Bedarf automatisch 'chdman' herunter und verarbeitet Archive (ZIP/7Z) als Eingabe.\n\nVerwendung:\n1. Wählen Sie Quell- und Zielordner aus.\n2. Wählen Sie den Modus: Info, Überprüfen, Konvertieren oder Extrahieren.\n3. Passen Sie die Anzahl der CPU-Kerne (Threads) an Ihre Maschine an.\n4. Klicken Sie auf 'Starten', um die Verarbeitung zu starten.",
    "ES": "CHDManager es la herramienta definitiva para comprimir tus juegos de CD (PS1, Dreamcast, Saturn...) al formato CHD.\n\nFuncionalidades:\n- Compresión de Alto Rendimiento: Convierte ISO, GDI, CUE a CHD para ahorrar hasta un 60% de espacio.\n- Multi-Hilo: Utiliza todos los núcleos de tu procesador para una velocidad máxima.\n- Interfaz Completa: Permite convertir (A CHD), extraer (A CUE/BIN), verificar u obtener información sobre tus imágenes.\n- Gestión Automática: Descarga 'chdman' automáticamente si es necesario y gestiona archivos (ZIP/7Z) de entrada.\n\nUso:\n1. Selecciona las carpetas Fuente y Destino.\n2. Elige el modo: Info, Verificar, Convertir o Extraer.\n3. Ajusta el número de núcleos CPU (Threads) según tu máquina.\n4. Haz clic en 'Iniciar' para lanzar el procesamiento.",
    "IT": "CHDManager è lo strumento definitivo per comprimere i tuoi giochi CD (PS1, Dreamcast, Saturn...) in formato CHD.\n\nFunzionalità:\n- Compressione ad Alte Prestazioni: Converte ISO, GDI, CUE in CHD per risparmiare fino al 60% di spazio.\n- Multi-Thread: Utilizza tutti i core del tuo processore per una velocità massima.\n- Interfaccia Completa: Permette di convertire (A CHD), estrarre (A CUE/BIN), verificare o ottenere informazioni sulle tue immagini.\n- Gestione Automatica: Scarica 'chdman' automaticamente se necessario e gestisce archivi (ZIP/7Z) in input.\n\nUso:\n1. Seleziona le cartelle Sorgente e Destinazione.\n2. Scegli la modalità: Info, Verifica, Converti o Estrai.\n3. Regola il numero di core CPU (Threads) in base alla tua macchina.\n4. Clicca su 'Avvia' per lanciare l'elaborazione.",
    "PT": "CHDManager é a ferramenta definitiva para comprimir os seus jogos de CD (PS1, Dreamcast, Saturn...) no formato CHD.\n\nFuncionalidades:\n- Compressão de Alto Desempenho: Converte ISO, GDI, CUE para CHD para poupar até 60% de espaço.\n- Multi-Thread: Utiliza todos os núcleos do seu processador para velocidade máxima.\n- Interface Completa: Permite converter (Para CHD), extrair (Para CUE/BIN), verificar ou obter informações sobre as suas imagens.\n- Gestão Automática: Descarrega 'chdman' automaticamente se necessário e gere arquivos (ZIP/7Z) como entrada.\n\nUtilização:\n1. Selecione as pastas Fonte e Destino.\n2. Escolha o modo: Info, Verificar, Converter ou Extrair.\n3. Ajuste o número de núcleos CPU (Threads) de acordo com a sua máquina.\n4. Clique em 'Iniciar' para lançar o processamento."
  },
  "CollectionBuilder": {
    "FR": "CollectionBuilder crée automatiquement des collections thématiques (ex: Zelda, Mario) en scannant vos metadonnées.\n\nFonctionnalités :\n- Scan Intelligent : Recherche vos mots-clés dans les descriptions de tous vos systèmes.\n- Création Automatique : Génère la structure de dossiers complète (Artworks, Menus) et les fichiers .sub.\n- Placeholders : Crée des fichiers images vides prêts à être remplacés par vos propres médias.\n- Multi-Systèmes : Unifie les jeux provenant de multiples consoles en une seule vue.\n\nUtilisation :\n1. Entrez un nom pour votre collection (ex: 'Star Wars').\n2. Indiquez le dossier racine contenant vos métadonnées RetroFE (HyperList).\n3. Saisissez vos mots-clés séparés par des point-virgules (ex: 'star wars;jedi;empire').\n4. Cliquez sur 'CRÉER' pour générer la collection.",
    "EN": "CollectionBuilder automatically creates thematic collections (ex: Zelda, Mario) by scanning your metadata.\n\nFeatures:\n- Intelligent Scan: Searches your keywords within descriptions of all your systems.\n- Automatic Creation: Generates complete folder structure (Artworks, Menus) and .sub files.\n- Placeholders: Creates empty image files ready to be replaced by your own media.\n- Multi-System: Unifies games from multiple consoles into a single view.\n\nUsage:\n1. Enter a name for your collection (ex: 'Star Wars').\n2. Indicate the root folder containing your RetroFE (HyperList) metadata.\n3. Enter your keywords separated by semicolons (ex: 'star wars;jedi;empire').\n4. Click 'CREATE' to generate the collection.",
    "DE": "CollectionBuilder erstellt automatisch thematische Sammlungen (z.B.: Zelda, Mario), indem es Ihre Metadaten scannt.\n\nFunktionen:\n- Intelligenter Scan: Durchsucht Ihre Schlüsselwörter in den Beschreibungen aller Ihrer Systeme.\n- Automatische Erstellung: Generiert die komplette Ordnerstruktur (Artworks, Menüs) und .sub-Dateien.\n- Platzhalter: Erstellt leere Bilddateien, die bereit sind, durch Ihre eigenen Medien ersetzt zu werden.\n- Multi-System: Vereint Spiele von mehreren Konsolen in einer einzigen Ansicht.\n\nVerwendung:\n1. Geben Sie einen Namen für Ihre Sammlung ein (z.B.: 'Star Wars').\n2. Geben Sie den Stammordner an, der Ihre RetroFE (HyperList)-Metadaten enthält.\n3. Geben Sie Ihre Schlüsselwörter durch Semikolons getrennt ein (z.B.: 'star wars;jedi;empire').\n4. Klicken Sie auf 'ERSTELLEN', um die Sammlung zu generieren.",
    "ES": "CollectionBuilder crea automáticamente colecciones temáticas (ej: Zelda, Mario) escaneando tus metadatos.\n\nFuncionalidades:\n- Escaneo Inteligente: Busca tus palabras clave en las descripciones de todos tus sistemas.\n- Creación Automática: Genera la estructura de carpetas completa (Artworks, Menús) y los archivos .sub.\n- Marcadores: Crea archivos de imagen vacíos listos para ser reemplazados por tus propios medios.\n- Multi-Sistemas: Unifica juegos provenientes de múltiples consolas en una sola vista.\n\nUso:\n1. Introduce un nombre para tu colección (ej: 'Star Wars').\n2. Indica la carpeta raíz que contiene tus metadatos RetroFE (HyperList).\n3. Introduce tus palabras clave separadas por punto y coma (ej: 'star wars;jedi;empire').\n4. Haz clic en 'CREAR' para generar la colección.",
    "IT": "CollectionBuilder crea automaticamente collezioni tematiche (es: Zelda, Mario) scansionando i tuoi metadati.\n\nFunzionalità:\n- Scansione Intelligente: Cerca le tue parole chiave nelle descrizioni di tutti i tuoi sistemi.\n- Creazione Automatica: Genera la struttura completa delle cartelle (Artwork, Menu) e i file .sub.\n- Segnaposto: Crea file immagine vuoti pronti per essere sostituiti dai tuoi media.\n- Multi-Sistema: Unifica giochi provenienti da più console in un'unica vista.\n\nUso:\n1. Inserisci un nome per la tua collezione (es: 'Star Wars').\n2. Indica la cartella radice contenente i tuoi metadati RetroFE (HyperList).\n3. Inserisci le tue parole chiave separate da punto e virgola (es: 'star wars;jedi;empire').\n4. Clicca su 'CREA' per generare la collezione.",
    "PT": "CollectionBuilder cria automaticamente coleções temáticas (ex: Zelda, Mario) analisando os seus metadados.\n\nFuncionalidades:\n- Análise Inteligente: Pesquisa as suas palavras-chave nas descrições de todos os seus sistemas.\n- Criação Automática: Gera a estrutura completa de pastas (Artwork, Menus) e ficheiros .sub.\n- Marcadores: Cria ficheiros de imagem vazios prontos a serem substituídos pelos seus próprios ficheiros multimédia.\n- Multi-Sistema: Unifica jogos de várias consolas numa única vista.\n\nUtilização:\n1. Introduza um nome para a sua coleção (ex: 'Star Wars').\n2. Indique a pasta raiz contendo os seus metadados RetroFE (HyperList).\n3. Introduza as suas palavras-chave separadas por ponto e vírgula (ex: 'star wars;jedi;empire').\n4. Clique em 'CRIAR' para gerar a coleção."
  },
  "CollectionExtractor": {
    "FR": "CollectionExtractor permet d'extraire proprement un système ou une collection complète pour la rendre portable ou autonome.\n\nFonctionnalités :\n- Extraction Chirurgicale : Isole une collection spécifique (ROMs, Média, Menus) de votre installation principale.\n- Gestion Dépendances : Copie également les cœurs d'émulateurs et les fichiers de configuration nécessaires.\n- Rapport Détaillé : Génère un rapport de fin d'opération listant les succès et les éventuels fichiers manquants.\n- Compatible : Prend en charge les systèmes standards et les collections thématiques.\n\nUtilisation :\n1. Indiquez le dossier racine de votre installation (ex: RetroFE/RetroBat).\n2. Sélectionnez le dossier Parent (Catégorie).\n3. Choisissez la Collection à extraire dans la liste.\n4. Configurez le type (Système/Collection) et l'émulateur cible (RetroArch/Autre).\n5. Cliquez sur 'EXÉCUTER'.",
    "EN": "CollectionExtractor allows clean extraction of a system or complete collection to make it portable or standalone.\n\nFeatures:\n- Surgical Extraction: Isolates a specific collection (ROMs, Media, Menus) from your main installation.\n- Dependency Management: Also copies emulator cores and necessary configuration files.\n- Detailed Report: Generates an operation report listing successes and any missing files.\n- Compatible: Supports standard systems and thematic collections.\n\nUsage:\n1. Indicate the root folder of your installation (ex: RetroFE/RetroBat).\n2. Select the Parent folder (Category).\n3. Choose the Collection to extract from the list.\n4. Configure type (System/Collection) and target emulator (RetroArch/Other).\n5. Click 'EXECUTE'.",
    "DE": "CollectionExtractor ermöglicht das saubere Extrahieren eines Systems oder einer vollständigen Sammlung, um sie tragbar oder eigenständig zu machen.\n\nFunktionen:\n- Chirurgische Extraktion: Isoliert eine bestimmte Sammlung (ROMs, Medien, Menüs) von Ihrer Hauptinstallation.\n- Abhängigkeitsmanagement: Kopiert auch Emulatorkerne und notwendige Konfigurationsdateien.\n- Detaillierter Bericht: Generiert einen Betriebsbericht, der Erfolge und eventuell fehlende Dateien auflistet.\n- Kompatibel: Unterstützt Standardsysteme und thematische Sammlungen.\n\nVerwendung:\n1. Geben Sie den Stammordner Ihrer Installation an (z.B. RetroFE/RetroBat).\n2. Wählen Sie den Elternordner (Kategorie).\n3. Wählen Sie die zu extrahierende Sammlung aus der Liste.\n4. Konfigurieren Sie Typ (System/Sammlung) und Zielemulator (RetroArch/Andere).\n5. Klicken Sie auf 'AUSFÜHREN'.",
    "ES": "CollectionExtractor permite extraer limpiamente un sistema o una colección completa para hacerla portátil o autónoma.\n\nFuncionalidades:\n- Extracción Quirúrgica: Aísla una colección específica (ROMs, Medios, Menús) de tu instalación principal.\n- Gestión Dependencias: Copia también los núcleos de emuladores y los archivos de configuración necesarios.\n- Informe Detallado: Genera un informe de fin de operación listando los éxitos y los posibles archivos faltantes.\n- Compatible: Soporta los sistemas estándar y las colecciones temáticas.\n\nUso:\n1. Indica la carpeta raíz de tu instalación (ej: RetroFE/RetroBat).\n2. Selecciona la carpeta Padre (Categoría).\n3. Elige la Colección a extraer en la lista.\n4. Configura el tipo (Sistema/Colección) y el emulador objetivo (RetroArch/Otro).\n5. Haz clic en 'EJECUTAR'.",
    "IT": "CollectionExtractor permette di estrarre pulitamente un sistema o una collezione completa per renderla portatile o autonoma.\n\nFunzionalità:\n- Estrazione Chirurgica: Isola una collezione specifica (ROMs, Media, Menu) dalla tua installazione principale.\n- Gestione Dipendenze: Copia anche i core di emulatori e i file di configurazione necessari.\n- Rapporto Dettagliato: Genera un rapporto di fine operazione elencando i successi ed eventuali file mancanti.\n- Compatibile: Supporta i sistemi standard e le collezioni tematiche.\n\nUso:\n1. Indica la cartella radice della tua installazione (es: RetroFE/RetroBat).\n2. Seleziona la cartella Genitore (Categoria).\n3. Scegli la Collezione da estrarre nella lista.\n4. Configura il tipo (Sistema/Collezione) e l'emulatore target (RetroArch/Altro).\n5. Clicca su 'ESEGUI'.",
    "PT": "CollectionExtractor permite extrair de forma limpa um sistema ou coleção completa para a tornar portátil ou autónoma.\n\nFuncionalidades:\n- Extração Cirúrgica: Isola uma coleção específica (ROMs, Media, Menus) da sua instalação principal.\n- Gestão de Dependências: Copia também os núcleos de emuladores e ficheiros de configuração necessários.\n- Relatório Detalhado: Gera um relatório de fim de operação listando sucessos e quaisquer ficheiros em falta.\n- Compatível: Suporta sistemas padrão e coleções temáticas.\n\nUtilização:\n1. Indique a pasta raiz da sua instalação (ex: RetroFE/RetroBat).\n2. Selecione a pasta Pai (Categoria).\n3. Escolha a Coleção a extrair da lista.\n4. Configure o tipo (Sistema/Coleção) e o emulador alvo (RetroArch/Outro).\n5. Clique em 'EXECUTAR'."
  },
  "CoverExtractor": {
    "FR": "CoverExtractor génère automatiquement les jaquettes de vos livres numériques (BD, Mangas, Magazines).\n\nFonctionnalités :\n- Extraction Visuelle : Récupère la première page ou image de vos fichiers PDF, CBZ, CBR, ZIP ou RAR.\n- Haute Qualité : Crée une image PNG du nom du fichier source.\n- Processus Récursif : Scanne le dossier sélectionné et tous ses sous-dossiers.\n- Simple : Idéal pour illustrer vos bibliothèques numériques dans vos frontends.\n\nUtilisation :\n1. Cliquez sur 'Parcourir' pour sélectionner le dossier contenant vos livres/comics.\n2. Cliquez sur 'EXECUTER'.\n3. L'outil génère une image .png pour chaque fichier compatible trouvé.",
    "EN": "CoverExtractor automatically generates covers for your digital books (Comics, Mangas, Magazines).\n\nFeatures:\n- Visual Extraction: Retrieves the first page or image from your PDF, CBZ, CBR, ZIP or RAR files.\n- High Quality: Creates a PNG image named after the source file.\n- Recursive Process: Scans the selected folder and all its subfolders.\n- Simple: Ideal for illustrating your digital libraries in your frontends.\n\nUsage:\n1. Click 'Browse' to select the folder containing your books/comics.\n2. Click 'EXECUTE'.\n3. The tool generates a .png image for each compatible file found.",
    "DE": "CoverExtractor generiert automatisch Cover für Ihre digitalen Bücher (Comics, Mangas, Magazine).\n\nFunktionen:\n- Visuelle Extraktion: Ruft die erste Seite oder das erste Bild Ihrer PDF-, CBZ-, CBR-, ZIP- oder RAR-Dateien ab.\n- Hohe Qualität: Erstellt ein PNG-Bild, das nach der Quelldatei benannt ist.\n- Rekursiver Prozess: Scannt den ausgewählten Ordner und alle seine Unterordner.\n- Einfach: Ideal zur Illustration Ihrer digitalen Bibliotheken in Ihren Frontends.\n\nVerwendung:\n1. Klicken Sie auf 'Durchsuchen', um den Ordner mit Ihren Büchern/Comics auszuwählen.\n2. Klicken Sie auf 'AUSFÜHREN'.\n3. Das Tool generiert ein .png-Bild für jede gefundene kompatible Datei.",
    "ES": "CoverExtractor genera automáticamente las portadas de tus libros digitales (Cómics, Mangas, Revistas).\n\nFuncionalidades:\n- Extracción Visual: Recupera la primera página o imagen de tus archivos PDF, CBZ, CBR, ZIP o RAR.\n- Alta Calidad: Crea una imagen PNG con el nombre del archivo fuente.\n- Proceso Recursivo: Escanea la carpeta seleccionada y todas sus subcarpetas.\n- Simple: Ideal para ilustrar tus bibliotecas digitales en tus frontends.\n\nUso:\n1. Haz clic en 'Examinar' para seleccionar la carpeta conteniendo tus libros/cómics.\n2. Haz clic en 'EJECUTAR'.\n3. La herramienta genera una imagen .png para cada archivo compatible encontrado.",
    "IT": "CoverExtractor genera automaticamente le copertine dei tuoi libri digitali (Fumetti, Manga, Riviste).\n\nFunzionalità:\n- Estrazione Visiva: Recupera la prima pagina o immagine dei tuoi file PDF, CBZ, CBR, ZIP o RAR.\n- Alta Qualità: Crea un'immagine PNG con il nome del file sorgente.\n- Processo Ricorsivo: Scansiona la cartella selezionata e tutte le sue sottocartelle.\n- Semplice: Ideale per illustrare le tue biblioteche digitali nei tuoi frontend.\n\nUso:\n1. Clicca su 'Sfoglia' per selezionare la cartella contenente i tuoi libri/fumetti.\n2. Clicca su 'ESEGUI'.\n3. Lo strumento genera un'immagine .png per ogni file compatibile trovato.",
    "PT": "CoverExtractor gera automaticamente capas para os seus livros digitais (Banda Desenhada, Manga, Revistas).\n\nFuncionalidades:\n- Extração Visual: Recupera a primeira página ou imagem dos seus ficheiros PDF, CBZ, CBR, ZIP ou RAR.\n- Alta Qualidade: Cria uma imagem PNG com o nome do ficheiro fonte.\n- Processo Recursivo: Analisa a pasta selecionada e todas as suas subpastas.\n- Simples: Ideal para ilustrar as suas bibliotecas digitais nos seus frontends.\n\nUtilização:\n1. Clique em 'Procurar' para selecionar a pasta que contém os seus livros/bd.\n2. Clique em 'EXECUTAR'.\n3. A ferramenta gera uma imagem .png para cada ficheiro compatível encontrado."
  },
  "DolphinConvert": {
    "FR": "Optimisez votre collection GameCube et Wii avec ce convertisseur spécialisé.\n\nFonctionnalités :\n- Compression Sans Perte : Convertit les fichiers ISO en format RVZ (jusqu'à -50% de taille).\n- Compatible Dolphin : Le format RVZ est nativement lu par l'émulateur Dolphin.\n- Réversible : Permet de reconstruire l'ISO original bit-à-bit si nécessaire.\n- Contrôle Avancé : Choix du format de compression (zstd, lzma) et de la taille de bloc.\n- Autonome : Télécharge automatiquement 'DolphinTool' s'il est manquant.\n\nUtilisation :\n1. Dossier Entrée : Dossier contenant vos ISO ou RVZ.\n2. Dossier Sortie : Dossier de destination.\n3. Opération : Choisissez 'ISO vers RVZ' ou 'RVZ vers ISO'.\n4. Cliquez sur 'DÉMARRER'.",
    "EN": "Optimize your GameCube and Wii collection with this specialized converter.\n\nFeatures:\n- Lossless Compression: Converts ISO files to RVZ format (up to -50% size).\n- Dolphin Compatible: The RVZ format is natively read by the Dolphin emulator.\n- Reversible: Allows reconstructing the original ISO bit-for-bit if needed.\n- Advanced Control: Choice of compression format (zstd, lzma) and block size.\n- Autonomous: Automatically downloads 'DolphinTool' if missing.\n\nUsage:\n1. Input Folder: Folder containing your ISO or RVZ files.\n2. Output Folder: Destination folder.\n3. Operation: Choose 'ISO to RVZ' or 'RVZ to ISO'.\n4. Click 'START'.",
    "DE": "Optimieren Sie Ihre GameCube- und Wii-Sammlung mit diesem spezialisierten Konverter.\n\nFunktionen:\n- Verlustfreie Komprimierung: Konvertiert ISO-Dateien in das RVZ-Format (bis zu -50% Größe).\n- Dolphin-kompatibel: Das RVZ-Format wird nativ vom Dolphin-Emulator gelesen.\n- Reversibel: Ermöglicht bei Bedarf die bitgenaue Wiederherstellung der ursprünglichen ISO.\n- Erweiterte Steuerung: Wahl des Komprimierungsformats (zstd, lzma) und der Blockgröße.\n- Autonom: Lädt 'DolphinTool' automatisch herunter, falls es fehlt.\n\nVerwendung:\n1. Eingabeordner: Ordner mit Ihren ISO- oder RVZ-Dateien.\n2. Ausgabeordner: Zielordner.\n3. Operation: Wählen Sie 'ISO zu RVZ' oder 'RVZ zu ISO'.\n4. Klicken Sie auf 'STARTEN'.",
    "ES": "Optimiza tu colección de GameCube y Wii con este convertidor especializado.\n\nFuncionalidades:\n- Compresión Sin Pérdida: Convierte archivos ISO al formato RVZ (hasta -50% de tamaño).\n- Compatible con Dolphin: El formato RVZ es leído nativamente por el emulador Dolphin.\n- Reversible: Permite reconstruir la ISO original bit a bit si es necesario.\n- Control Avanzado: Elección del formato de compresión (zstd, lzma) y del tamaño de bloque.\n- Autónomo: Descarga automáticamente 'DolphinTool' si falta.\n\nUso:\n1. Carpeta de Entrada: Carpeta que contiene tus ISO o RVZ.\n2. Carpeta de Salida: Carpeta de destino.\n3. Operación: Elige 'ISO a RVZ' o 'RVZ a ISO'.\n4. Haz clic en 'INICIAR'.",
    "IT": "Ottimizza la tua collezione GameCube e Wii con questo convertitore specializzato.\n\nFunzionalità:\n- Compressione Senza Perdita: Converte file ISO nel formato RVZ (fino a -50% di dimensione).\n- Compatibile Dolphin: Il formato RVZ è letto nativamente dall'emulatore Dolphin.\n- Reversibile: Permette di ricostruire l'ISO originale bit-a-bit se necessario.\n- Controllo Avanzato: Scelta del formato di compressione (zstd, lzma) e della dimensione del blocco.\n- Autonomo: Scarica automaticamente 'DolphinTool' se mancante.\n\nUso:\n1. Cartella Input: Cartella contenente i tuoi ISO o RVZ.\n2. Cartella Output: Cartella di destinazione.\n3. Operazione: Scegli 'ISO a RVZ' o 'RVZ a ISO'.\n4. Clicca su 'AVVIA'.",
    "PT": "Otimize a sua coleção GameCube e Wii com este conversor especializado.\n\nFuncionalidades:\n- Compressão Sem Perdas: Converte ficheiros ISO para o formato RVZ (até -50% de tamanho).\n- Compatível com Dolphin: O formato RVZ é lido nativamente pelo emulador Dolphin.\n- Reversível: Permite reconstruir o ISO original bit a bit, se necessário.\n- Controlo Avançado: Escolha do formato de compressão (zstd, lzma) e tamanho do bloco.\n- Autónomo: Descarrega automaticamente 'DolphinTool' se estiver em falta.\n\nUtilização:\n1. Pasta de Entrada: Pasta contendo os seus ficheiros ISO ou RVZ.\n2. Pasta de Saída: Pasta de destino.\n3. Operação: Escolha 'ISO para RVZ' ou 'RVZ para ISO'.\n4. Clique em 'INICIAR'."
  },
  "EmptyGen": {
    "FR": "EmptyGen crée rapidement des fichiers vides avec l'extension de votre choix pour tromper les émulateurs ou préparer une structure.\n\nFonctionnalités :\n- Création en Masse : Génère un fichier pour chaque sous-dossier présent dans le répertoire cible.\n- Extensions Intégrées : Présélections pour ScummVM (.scummvm), Singe (.singe), Commander Genius (.cgenius).\n- Personnalisable : Permet de définir n'importe quelle extension personnalisée .\n- Structure : Utile pour convertir un dossier de jeux décompressés en une liste de fichiers reconnus par votre frontend.\n\nUtilisation :\n1. Choisissez une extension (ex: .scummvm) ou tapez-en une personnalisée.\n2. Cliquez sur 'Choisir Dossier' pour sélectionner la racine de vos jeux.\n3. Cliquez sur 'CRÉER FICHIERS'.",
    "EN": "EmptyGen quickly creates empty files with the extension of your choice to trick emulators or prepare a structure.\n\nFeatures:\n- Mass Creation: Generates a file for each subfolder present in the target directory.\n- Built-in Extensions: Presets for ScummVM (.scummvm), Singe (.singe), Commander Genius (.cgenius).\n- Customizable: Allows defining any custom extension.\n- Structure: Useful for converting a folder of decompressed games into a list of files recognized by your frontend.\n\nUsage:\n1. Choose an extension (ex: .scummvm) or type a custom one.\n2. Click 'Choose Folder' to select your game root.\n3. Click 'CREATE FILES'.",
    "DE": "EmptyGen erstellt schnell leere Dateien mit der Erweiterung Ihrer Wahl, um Emulatoren zu täuschen oder eine Struktur vorzubereiten.\n\nFunktionen:\n- Massenerstellung: Generiert eine Datei für jeden Unterordner im Zielverzeichnis.\n- Integrierte Erweiterungen: Voreinstellungen für ScummVM (.scummvm), Singe (.singe), Commander Genius (.cgenius).\n- Anpassbar: Ermöglicht das Definieren einer benutzerdefinierten Erweiterung.\n- Struktur: Nützlich, um einen Ordner mit dekomprimierten Spielen in eine Liste von Dateien zu konvertieren, die von Ihrem Frontend erkannt werden.\n\nVerwendung:\n1. Wählen Sie eine Erweiterung (z.B. .scummvm) oder geben Sie eine eigene ein.\n2. Klicken Sie auf 'Ordner wählen', um das Stammverzeichnis Ihrer Spiele auszuwählen.\n3. Klicken Sie auf 'DATEIEN ERSTELLEN'.",
    "ES": "EmptyGen crea rápidamente archivos vacíos con la extensión de tu elección para engañar a los emuladores o preparar una estructura.\n\nFuncionalidades:\n- Creación en Masa: Genera un archivo para cada subcarpeta presente en el directorio objetivo.\n- Extensiones Integradas: Preajustes para ScummVM (.scummvm), Singe (.singe), Commander Genius (.cgenius).\n- Personalizable: Permite definir cualquier extensión personalizada.\n- Estructura: Útil para convertir una carpeta de juegos descomprimidos en una lista de archivos reconocidos por tu frontend.\n\nUso:\n1. Elige una extensión (ej: .scummvm) o escribe una personalizada.\n2. Haz clic en 'Elegir Carpeta' para seleccionar la raíz de tus juegos.\n3. Haz clic en 'CREAR ARCHIVOS'.",
    "IT": "EmptyGen crea rapidamente file vuoti con l'estensione di tua scelta per ingannare gli emulatori o preparare una struttura.\n\nFunzionalità:\n- Creazione in Massa: Genera un file per ogni sottocartella presente nella directory di destinazione.\n- Estensioni Integrate: Predefiniti per ScummVM (.scummvm), Singe (.singe), Commander Genius (.cgenius).\n- Personalizzabile: Permette di definire qualsiasi estensione personalizzata.\n- Struttura: Utile per convertire una cartella di giochi decompressi in un elenco di file riconosciuti dal tuo frontend.\n\nUso:\n1. Scegli un'estensione (es: .scummvm) o digitane una personalizzata.\n2. Clicca su 'Scegli Cartella' per selezionare la radice dei tuoi giochi.\n3. Clicca su 'CREA FILE'.",
    "PT": "EmptyGen cria rapidamente ficheiros vazios com a extensão à sua escolha para enganar emuladores ou preparar uma estrutura.\n\nFuncionalidades:\n- Criação em Massa: Gera um ficheiro para cada subpasta presente no diretório de destino.\n- Extensões Integradas: Predefinições para ScummVM (.scummvm), Singe (.singe), Commander Genius (.cgenius).\n- Personalizável: Permite definir qualquer extensão personalizada.\n- Estrutura: Útil para converter uma pasta de jogos descompactados numa lista de ficheiros reconhecidos pelo seu frontend.\n\nUtilização:\n1. Escolha uma extensão (ex: .scummvm) ou digite uma personalizada.\n2. Clique em 'Escolher Pasta' para selecionar a raiz dos seus jogos.\n3. Clique em 'CRIAR FICHEIROS'."
  },
  "FolderCleaner": {
    "FR": "FolderCleaner fait le ménage dans vos dossiers en supprimant récursivement tous les répertoires vides.\n\nFonctionnalités :\n- Analyse Récursive : Scanne le dossier racine et toute son arborescence.\n- Sécurité : Ne supprime QUE les dossiers qui sont strictement vides ou ne contiennent que d'autres dossiers vides.\n- Rapport en Temps Réel : Affiche le nombre de dossiers analysés et supprimés.\n- Utilité : Idéal après un tri manuel, une suppression de ROMs en masse ou un nettoyage de médias.\n\nUtilisation :\n1. Entrez le chemin ou cliquez sur 'Parcourir'.\n2. Cliquez sur 'NETTOYER'.\n3. L'outil supprime les dossiers vides et affiche le résultat.",
    "EN": "FolderCleaner cleans up your folders by recursively deleting all empty directories.\n\nFeatures:\n- Recursive Analysis: Scans the root folder and its entire tree.\n- Safety: Deletes ONLY folders that are strictly empty or contain only other empty folders.\n- Real-Time Report: Displays the number of folders scanned and deleted.\n- Utility: Ideal after manual sorting, mass ROM deletion, or media cleanup.\n\nUsage:\n1. Enter the path or click 'Browse'.\n2. Click 'CLEAN'.\n3. The tool removes empty folders and displays the result.",
    "DE": "FolderCleaner räumt Ihre Ordner auf, indem es rekursiv alle leeren Verzeichnisse löscht.\n\nFunktionen:\n- Rekursive Analyse: Scannt den Stammordner und seinen gesamten Baum.\n- Sicherheit: Löscht NUR Ordner, die streng leer sind oder nur andere leere Ordner enthalten.\n- Echtzeitbericht: Zeigt die Anzahl der gescannten und gelöschten Ordner an.\n- Nützlichkeit: Ideal nach manuellem Sortieren, Massenlöschen von ROMs oder Medienbereinigung.\n\nVerwendung:\n1. Geben Sie den Pfad ein oder klicken Sie auf 'Durchsuchen'.\n2. Klicken Sie auf 'REINIGEN'.\n3. Das Werkzeug entfernt leere Ordner und zeigt das Ergebnis an.",
    "ES": "FolderCleaner limpia tus carpetas eliminando recursivamente todos los directorios vacíos.\n\nFuncionalidades:\n- Análisis Recursivo: Escanea la carpeta raíz y todo su árbol.\n- Seguridad: Elimina SOLO las carpetas que están estrictamente vacías o contienen solo otras carpetas vacías.\n- Informe en Tiempo Real: Muestra el número de carpetas escaneadas y eliminadas.\n- Utilidad: Ideal después de una clasificación manual, eliminación masiva de ROMs o limpieza de medios.\n\nUso:\n1. Introduce la ruta o haz clic en 'Examinar'.\n2. Haz clic en 'LIMPIAR'.\n3. La herramienta elimina las carpetas vacías y muestra el resultado.",
    "IT": "FolderCleaner fa pulizia nelle tue cartelle eliminando ricorsivamente tutte le directory vuote.\n\nFunzionalità:\n- Analisi Ricorsiva: Scansiona la cartella radice e tutto il suo albero.\n- Sicurezza: Elimina SOLO le cartelle che sono rigorosamente vuote o contengono solo altre cartelle vuote.\n- Rapporto in Tempo Reale: Visualizza il numero di cartelle scansionate ed eliminate.\n- Utilità: Ideale dopo un ordinamento manuale, eliminazione di massa di ROM o pulizia media.\n\nUso:\n1. Inserisci il percorso o clicca su 'Sfoglia'.\n2. Clicca su 'PULIRE'.\n3. Lo strumento rimuove le cartelle vuote e mostra il risultato.",
    "PT": "FolderCleaner limpa as suas pastas eliminando recursivamente todos os diretórios vazios.\n\nFuncionalidades:\n- Análise Recursiva: Analisa a pasta raiz e toda a sua árvore.\n- Segurança: Elimina APENAS pastas que estão estritamente vazias ou contêm apenas outras pastas vazias.\n- Relatório em Tempo Real: Exibe o número de pastas analisadas e eliminadas.\n- Utilidade: Ideal após uma triagem manual, eliminação em massa de ROMs ou limpeza de média.\n\nUtilização:\n1. Introduza o caminho ou clique em 'Procurar'.\n2. Clique em 'LIMPAR'.\n3. A ferramenta remove pastas vazias e exibe o resultado."
  },
  "FolderToTxt": {
    "FR": "FolderToTxt génère des fichiers texte fictifs basés sur le contenu d'un dossier.\n\nFonctionnalités :\n- Clonage de Noms : Crée un fichier .txt portant le même nom que chaque fichier source trouvé.\n- Filtrage par Extension : Ne traite que les fichiers avec l'extension spécifiée (ex: 'mp4').\n- Rapide : Idéal pour générer des listes de lecture ou des placeholders.\n\nUtilisation :\n1. Dossier : Sélectionnez le dossier source.\n2. Extension source : Entrez l'extension à cibler (ex: 'mp4', 'iso').\n3. Cliquez sur 'CRÉER .TXT'.",
    "EN": "FolderToTxt generates dummy text files based on folder content.\n\nFeatures:\n- Name Cloning: Creates a .txt file with the same name as each source file found.\n- Extension Filtering: Processes only files with the specified extension (ex: 'mp4').\n- Fast: Ideal for generating playlists or placeholders.\n\nUsage:\n1. Folder: Select source folder.\n2. Source Extension: Enter extension to target (ex: 'mp4', 'iso').\n3. Click 'CREATE .TXT'.",
    "DE": "FolderToTxt generiert fiktive Textdateien basierend auf dem Ordnerinhalt.\n\nFunktionen:\n- Namensklonen: Erstellt eine .txt-Datei mit demselben Namen wie jede gefundene Quelldatei.\n- Erweiterungsfilterung: Verarbeitet nur Dateien mit der angegebenen Erweiterung (z.B.: 'mp4').\n- Schnell: Ideal zum Erstellen von Wiedergabelisten oder Platzhaltern.\n\nVerwendung:\n1. Ordner: Wählen Sie den Quellordner.\n2. Quellerweiterung: Geben Sie die zu zielende Erweiterung ein (z.B.: 'mp4', 'iso').\n3. Klicken Sie auf 'DATEIEN ERSTELLEN'.",
    "ES": "FolderToTxt genera archivos de texto ficticios basados en el contenido de una carpeta.\n\nFuncionalidades:\n- Clonación de Nombres: Crea un archivo .txt con el mismo nombre que cada archivo fuente encontrado.\n- Filtrado por Extensión: Procesa solo los archivos con la extensión especificada (ej: 'mp4').\n- Rápido: Ideal para generar listas de reproducción o marcadores.\n\nUso:\n1. Carpeta: Selecciona la carpeta fuente.\n2. Extensión fuente: Introduce la extensión a apuntar (ej: 'mp4', 'iso').\n3. Haz clic en 'CREAR .TXT'.",
    "IT": "FolderToTxt genera file di testo fittizi basati sul contenuto di una cartella.\n\nFunzionalità:\n- Clonazione Nomi: Crea un file .txt con lo stesso nome di ogni file sorgente trovato.\n- Filtraggio per Estensione: Elabora solo i file con l'estensione specificata (es: 'mp4').\n- Veloce: Ideale per generare playlist o segnaposto.\n\nUso:\n1. Cartella: Seleziona la cartella sorgente.\n2. Estensione sorgente: Inserisci l'estensione da puntare (es: 'mp4', 'iso').\n3. Clicca su 'CREA .TXT'.",
    "PT": "FolderToTxt gera ficheiros de texto fictícios baseados no conteúdo de uma pasta.\n\nFuncionalidades:\n- Clonagem de Nomes: Cria um ficheiro .txt com o mesmo nome de cada ficheiro fonte encontrado.\n- Filtragem por Extensão: Processa apenas os ficheiros com a extensão especificada (ex: 'mp4').\n- Rápido: Ideal para gerar listas de reprodução ou marcadores.\n\nUtilização:\n1. Pasta: Selecione a pasta fonte.\n2. Extensão fonte: Introduza a extensão a visar (ex: 'mp4', 'iso').\n3. Clique em 'CRIAR .TXT'."
  },
  "FolderToZip": {
    "FR": "FolderToZip compresse individuellement chaque fichier d'un dossier en ZIP et supprime l'original. \n\nFonctionnalités :\n- Compression Unitaire : Chaque fichier ROM devient sa propre archive ZIP.\n- Gain d'Espace : Utilise la compression ZIP standard pour réduire la taille.\n- Nettoyage : Supprime automatiquement le fichier source après une compression réussie.\n- Efficace : Idéal pour les sets de ROMs 'No-Intro' ou pour économiser de l'espace rapidement.\n\nUtilisation :\n1. Entrez le chemin du dossier ou cliquez sur 'Parcourir'.\n2. Cliquez sur 'COMPRESSER & SUPPRIMER ORIGINAUX'.\nAttention : L'action est irréversible pour les fichiers originaux (mais ils sont dans le ZIP).",
    "EN": "FolderToZip individually compresses each file in a folder to ZIP and deletes the original.\n\nFeatures:\n- Unitary Compression: Each ROM file becomes its own ZIP archive.\n- Space Saving: Uses standard ZIP compression to reduce size.\n- Cleanup: Automatically deletes the source file after successful compression.\n- Efficient: Ideal for 'No-Intro' ROM sets or saving space quickly.\n\nUsage:\n1. Enter the folder path or click 'Browse'.\n2. Click 'COMPRESS & DELETE ORIGINALS'.\nWarning: The action is irreversible for original files (but they are in the ZIP).",
    "DE": "FolderToZip komprimiert jede Datei in einem Ordner einzeln in ZIP und löscht das Original.\n\nFunktionen:\n- Einzelkomprimierung: Jede ROM-Datei wird zu ihrem eigenen ZIP-Archiv.\n- Platzersparnis: Verwendet Standard-ZIP-Komprimierung zur Reduzierung der Größe.\n- Bereinigung: Löscht die Quelldatei automatisch nach erfolgreicher Komprimierung.\n- Effizient: Ideal für 'No-Intro' ROM-Sets oder um schnell Platz zu sparen.\n\nVerwendung:\n1. Geben Sie den Ordnerpfad ein oder klicken Sie auf 'Durchsuchen'.\n2. Klicken Sie auf 'KOMPRIMIEREN & ORIGINALE LÖSCHEN'.\nAchtung: Die Aktion ist für Originaldateien irreversibel (aber sie sind im ZIP).",
    "ES": "FolderToZip comprime individualmente cada archivo de una carpeta en ZIP y elimina el original.\n\nFuncionalidades:\n- Compresión Unitaria: Cada archivo ROM se convierte en su propio archivo ZIP.\n- Ahorro de Espacio: Utiliza la compresión ZIP estándar para reducir el tamaño.\n- Limpieza: Elimina automáticamente el archivo fuente tras una compresión exitosa.\n- Eficiente: Ideal para los sets de ROMs 'No-Intro' o para ahorrar espacio rápidamente.\n\nUso:\n1. Introduce la ruta de la carpeta o haz clic en 'Examinar'.\n2. Haz clic en 'COMPRIMIR Y ELIMINAR ORIGINALES'.\nAtención: La acción es irreversible para los archivos originales (but they are in the ZIP).",
    "IT": "FolderToZip comprime individualmente ogni file di una cartella in ZIP ed elimina l'originale.\n\nFunzionalità:\n- Compressione Unitaria: Ogni file ROM diventa il proprio archivio ZIP.\n- Risparmio Spazio: Utilizza la compressione ZIP standard per ridurre le dimensioni.\n- Pulizia: Elimina automaticamente il file sorgente dopo una compressione riuscita.\n- Efficiente: Ideale per i set di ROM 'No-Intro' o per risparmiare spazio rapidamente.\n\nUso:\n1. Inserisci il percorso della cartella o clicca su 'Sfoglia'.\n2. Clicca su 'COMPRIMI & ELIMINA ORIGINALI'.\nAttenzione: L'action è irreversibile per i file originali (ma sono nello ZIP).",
    "PT": "FolderToZip comprime individualmente cada ficheiro de uma pasta em ZIP e elimina o original.\n\nFuncionalidades:\n- Compressão Unitária: Cada ficheiro ROM torna-se o seu próprio arquivo ZIP.\n- Poupança de Espaço: Utiliza a compressão ZIP padrão para reduzir o tamanho.\n- Limpeza: Elimina automaticamente o ficheiro fonte após uma compressão bem-sucedida.\n- Eficiente: Ideal para conjuntos de ROMs 'No-Intro' ou para poupar espaço rapidamente.\n\nUtilização:\n1. Introduza o caminho da pasta ou clique em 'Procurar'.\n2. Clique em 'COMPRIMIR & ELIMINAR ORIGINAIS'.\nAtenção: A ação é irreversível para os ficheiros originais (mas eles estão no ZIP)."
  },
  "GameBatch": {
    "FR": "GameBatch intègre vos jeux PC, Steam et Epic Games dans votre interface rétro via des scripts .bat.\n\nFonctionnalités :\n- Scripts Universels : Crée des lanceurs .bat compatibles avec tous les frontends (RetroBat, EmulationStation, etc.).\n- Support Steam : Lance les jeux via leur ID Steam (steam://rungameid/...) et surveille l'exécutable pour une fermeture propre.\n- Support Epic/PC : Gère les jeux Epic via URL et les exe Windows standards.\n- Surveillance de Processus : Le script attend la fermeture réelle du jeu pour rendre la main au frontend.\n\nUtilisation :\n1. Choisissez le dossier de destination des scripts.\n2. Remplissez les champs selon le type de jeu (Normal, Steam, Epic).\n- Steam : ID du jeu et nom de l'exe à surveiller.\n- Epic : Nom de l'exe à surveiller et fichier .URL du jeu.\n3. Cliquez sur le bouton 'Créer Batch' correspondant.",
    "DE": "GameBatch integriert Ihre PC-, Steam- und Epic Games-Spiele über .bat-Skripte in Ihre Retro-Oberfläche.\n\nFunktionen:\n- Universelle Skripte: Erstellt .bat-Launcher, die mit allen Frontends (RetroBat, EmulationStation usw.) kompatibel sind.\n- Steam-Unterstützung: Startet Spiele über ihre Steam-ID (steam://rungameid/...) und überwacht die ausführbare Datei für ein sauberes Schließen.\n- Epic/PC-Unterstützung: Verwaltet Epic-Spiele über URL und Standard-Windows-Exes.\n- Prozessüberwachung: Das Skript wartet auf das tatsächliche Schließen des Spiels, um die Kontrolle an das Frontend zurückzugeben.\n\nVerwendung:\n1. Wählen Sie den Zielordner für die Skripte.\n2. Füllen Sie die Felder je nach Spieltyp aus (Normal, Steam, Epic).\n- Steam: Spiel-ID und Name der zu überwachenden Exe.\n- Epic: Name der zu überwachenden Exe und .URL-Datei des Spiels.\n3. Klicken Sie auf die entsprechende Schaltfläche 'Batch erstellen'.",
    "EN": "GameBatch integrates your PC, Steam, and Epic Games into your retro interface via .bat scripts.\n\nFeatures:\n- Universal Scripts: Creates .bat launchers compatible with all frontends (RetroBat, EmulationStation, etc.).\n- Steam Support: Launches games via their Steam ID (steam://rungameid/...) and monitors the executable for clean detailed closure.\n- Epic/PC Support: Manages Epic games via URL and standard Windows exes.\n- Process Monitoring: The script waits for the actual game closure to return control to the frontend.\n\nUsage:\n1. Choose the destination folder for scripts.\n2. Fill in fields according to game type (Normal, Steam, Epic).\n- Steam: Game ID and name of exe to monitor.\n- Epic: Name of exe to monitor and game .URL file.\n3. Click the corresponding 'Create Batch' button.",
    "ES": "GameBatch integra tus juegos de PC, Steam y Epic Games en tu interfaz retro a través de scripts .bat.\n\nFuncionalidades:\n- Scripts Universales: Crea lanzadores .bat compatibles con todos los frontends (RetroBat, EmulationStation, etc.).\n- Soporte Steam: Lanza juegos a través de su ID de Steam (steam://rungameid/...) y monitorea el ejecutable para un cierre limpio.\n- Soporte Epic/PC: Gestiona juegos Epic vía URL y exes de Windows estándar.\n- Monitoreo de Procesos: El script espera el cierre real del juego para devolver el control al frontend.\n\nUso:\n1. Elige la carpeta de destino de los scripts.\n2. Rellena los campos según el tipo de juego (Normal, Steam, Epic).\n- Steam: ID del juego y nombre del exe a monitorear.\n- Epic: Nombre del exe a monitorear y archivo .URL del juego.\n3. Haz clic en el botón 'Crear Batch' correspondiente.",
    "IT": "GameBatch integra i tuoi giochi PC, Steam ed Epic Games nella tua interfaccia retro tramite script .bat.\n\nFunzionalità:\n- Script Universali: Crea launcher .bat compatibili con tutti i frontend (RetroBat, EmulationStation, ecc.).\n- Supporto Steam: Avvia i giochi tramite il loro ID Steam (steam://rungameid/...) e monitora l'eseguibile per una chiusura pulita.\n- Supporto Epic/PC: Gestisce giochi Epic via URL ed exe Windows standard.\n- Monitoraggio Processi: Lo script attende la chiusura effettiva del gioco per restituire il controllo al frontend.\n\nUso:\n1. Scegli la cartella di destinazione degli script.\n2. Compila i campi in base al tipo di gioco (Normale, Steam, Epic).\n- Steam: ID del gioco e nome dell'exe da monitorare.\n- Epic: Nome dell'exe da monitorare e file .URL del gioco.\n3. Clicca sul pulsante 'Crea Batch' corrispondente.",
    "PT": "GameBatch integra os seus jogos PC, Steam e Epic Games na sua interface retro através de scripts .bat.\n\nFuncionalidades:\n- Scripts Universais: Cria lançadores .bat compatíveis com todos os frontends (RetroBat, EmulationStation, etc.).\n- Suporte Steam: Lança os jogos através do seu ID Steam (steam://rungameid/...) e monitoriza o executável para um encerramento limpo.\n- Suporte Epic/PC: Gere jogos Epic via URL e exes padrão do Windows.\n- Monitorização de Processos: O script aguarda o encerramento real do jogo para devolver o controlo ao frontend.\n\nUtilização:\n1. Escolha a pasta de destino dos scripts.\n2. Preencha os campos de acordo com o tipo de jogo (Normal, Steam, Epic).\n- Steam: ID do jogo e nome do exe a monitorizar.\n- Epic: Nome do exe a monitorizar e ficheiro .URL do jogo.\n3. Clique no botão 'Criar Batch' correspondente."
  },
  "GamelistHyperlist": {
    "FR": "Convertit vos fichiers 'gamelist.xml' (Format RetroBat) vers le format HyperList (RetroFE).\n\nFonctionnalités :\n- Traduction de Format : Transforme la structure XML de RetroBat en standard RetroFE (HyperList).\n- Extraction de Descriptions : Sauvegarde les descriptions de chaque jeu dans des fichiers texte individuels séparés.\n- Compatibilité : Permet d'utiliser vos métadonnées scrappées sur RetroBat avec d'autres frontends comme RetroFE.\n- Simple : Une entrée, une sortie, un clic.\n\nUtilisation :\n1. Gamelist XML : Sélectionnez votre fichier source.\n2. Output Dir : Choisissez le dossier de destination.\n3. Cliquez sur 'CONVERTIR'.",
    "EN": "Converts your 'gamelist.xml' files (RetroBat Format) to HyperList format (RetroFE).\n\nFeatures:\n- Format Translation: Transforms RetroBat XML structure into RetroFE (HyperList) standard.\n- Description Extraction: Saves descriptions of each game into separate individual text files.\n- Compatibility: Allows using your scraped metadata on RetroBat with other frontends like RetroFE.\n- Simple: One input, one output, one click.\n\nUsage:\n1. Gamelist XML: Select your source file.\n2. Output Dir: Choose destination folder.\n3. Click 'CONVERT'.",
    "DE": "Konvertiert Ihre 'gamelist.xml'-Dateien (RetroBat-Format) in das HyperList-Format (RetroFE).\n\nFunktionen:\n- Formatübersetzung: Wandelt die RetroBat-XML-Struktur in den RetroFE-Standard (HyperList) um.\n- Beschreibungsextraktion: Speichert die Beschreibungen jedes Spiels in separaten Textdateien.\n- Kompatibilität: Ermöglicht die Verwendung Ihrer gescrapten Metadaten auf RetroBat mit anderen Frontends wie RetroFE.\n- Einfach: Eine Eingabe, eine Ausgabe, ein Klick.\n\nVerwendung:\n1. Gamelist XML: Wählen Sie Ihre Quelldatei aus.\n2. Ausgabeverzeichnis: Wählen Sie den Zielordner.\n3. Klicken Sie auf 'KONVERTIEREN'.",
    "ES": "Convierte tus archivos 'gamelist.xml' (Formato RetroBat) al formato HyperList (RetroFE).\n\nFuncionalidades:\n- Traducción de Formato: Transforma la estructura XML de RetroBat en estándar RetroFE (HyperList).\n- Extracción de Descripciones: Guarda las descripciones de cada juego en archivos de texto individuales separados.\n- Compatibilidad: Permite usar tus metadatos scrapeados en RetroBat con otros frontends como RetroFE.\n- Simple: Una entrada, una salida, un clic.\n\nUso:\n1. Gamelist XML: Selecciona tu archivo fuente.\n2. Directorio de Salida: Elige la carpeta de destino.\n3. Haz clic en 'CONVERTIR'.",
    "IT": "Converte i tuoi file 'gamelist.xml' (Formato RetroBat) in formato HyperList (RetroFE).\n\nFunzionalità:\n- Traduzione Formato: Trasforma la struttura XML di RetroBat in standard RetroFE (HyperList).\n- Estrazione Descrizioni: Salva le descrizioni di ogni gioco in file di testo individuali separati.\n- Compatibilità: Permette di utilizzare i tuoi metadati scrapeati su RetroBat con altri frontend come RetroFE.\n- Semplice: Un input, un output, un clic.\n\nUso:\n1. Gamelist XML: Seleziona il tuo file sorgente.\n2. Output Dir: Scegli la cartella di destinazione.\n3. Clicca su 'CONVERTI'.",
    "PT": "Converte os seus ficheiros 'gamelist.xml' (Formato RetroBat) para o formato HyperList (RetroFE).\n\nFuncionalidades:\n- Tradução de Formato: Transforma a estrutura XML do RetroBat em padrão RetroFE (HyperList).\n- Extração de Descrições: Guarda as descrições de cada jogo em ficheiros de texto individuais separados.\n- Compatibilidade: Permite utilizar os seus metadados recolhidos no RetroBat com outros frontends como RetroFE.\n- Simples: Uma entrada, uma saída, um clique.\n\nUtilização:\n1. Gamelist XML: Selecione o seu ficheiro fonte.\n2. Output Dir: Escolha a pasta de destino.\n3. Clique em 'CONVERTER'."
  },
  "GameRemoval": {
    "FR": "GameRemoval facilite la suppression propre de jeux depuis votre interface Collection (RetroFE).\n\nFonctionnalités :\n- Navigation Hiérarchique : Parcourt vos collections par catégorie (Main) et par système.\n- Sélection Visuelle : Affiche la liste des jeux présents dans le ROMs du système choisi.\n- Suppression Complète : Supprime le fichier du jeu (ROM) ET ses médias associés (images, vidéos) pour ne laisser aucun orphelin.\n- Sécurité : Demande confirmation avant suppression définitive.\n\nUtilisation :\n1. Sélectionnez le dossier de base de votre installation.\n2. Naviguez vers le menu et le système souhaité via les listes déroulantes.\n3. Cochez les jeux à supprimer dans la liste.\n4. Cliquez sur 'SUPPRIMER SÉLECTION'.",
    "EN": "GameRemoval facilitates clean game deletion from your Collection interface (RetroFE).\n\nFeatures:\n- Hierarchical Navigation: Browses your collections by category (Main) and by system.\n- Visual Selection: Displays the list of games present in the ROMs folder of the chosen system.\n- Complete Deletion: Deletes the game file (ROM) AND its associated media (images, videos) to leave no orphans.\n- Safety: Asks for confirmation before permanent deletion.\n\nUsage:\n1. Select the base folder of your installation.\n2. Navigate to the desired menu and system via dropdown lists.\n3. Check the games to delete in the list.\n4. Click 'DELETE SELECTION'.",
    "DE": "GameRemoval erleichtert das saubere Löschen von Spielen von Ihrer Collection-Oberfläche (RetroFE).\n\nFunktionen:\n- Hierarchische Navigation: Durchsucht Ihre Sammlungen nach Kategorie (Main) und System.\n- Visuelle Auswahl: Zeigt die Liste der Spiele im ROM-Ordner des gewählten Systems an.\n- Vollständiges Löschen: Löscht die Spieledatei (ROM) UND ihre zugehörigen Medien (Bilder, Videos), um keine Waisen zu hinterlassen.\n- Sicherheit: Fragt vor dem endgültigen Löschen um Bestätigung.\n\nVerwendung:\n1. Wählen Sie den Basisordner Ihrer Installation.\n2. Navigieren Sie über die Dropdown-Listen zum gewünschten Menü und System.\n3. Markieren Sie die zu löschenden Spiele in der Liste.\n4. Klicken Sie auf 'AUSWAHL LÖSCHEN'.",
    "ES": "GameRemoval facilita la eliminación limpia de juegos desde tu interfaz de Colección (RetroFE).\n\nFuncionalidades:\n- Navegación Jerárquica: Recorre tus colecciones por categoría (Main) y por sistema.\n- Selección Visual: Muestra la lista de juegos presentes en la carpeta ROMs del sistema elegido.\n- Eliminación Completa: Elimina el archivo del juego (ROM) Y sus medios asociados (imágenes, videos) para no dejar huérfanos.\n- Seguridad: Pide confirmación antes de la eliminación definitiva.\n\nUso:\n1. Selecciona la carpeta base de tu instalación.\n2. Navega hacia el menú y el sistema deseado a través de las listas desplegables.\n3. Marca los juegos a eliminar en la lista.\n4. Haz clic en 'ELIMINAR SELECCIÓN'.",
    "IT": "GameRemoval facilita l'eliminazione pulita dei giochi dalla tua interfaccia Collection (RetroFE).\n\nFunzionalità:\n- Navigazione Gerarchica: Sfoglia le tue collezioni per categoria (Main) e per sistema.\n- Selezione Visiva: Mostra l'elenco dei giochi presenti nella cartella ROM del sistema scelto.\n- Eliminazione Completa: Elimina il file di gioco (ROM) E i suoi media associati (immagini, video) per non lasciare orfani.\n- Sicurezza: Chiede conferma prima dell'eliminazione definitiva.\n\nUso:\n1. Seleziona la cartella base della tua installazione.\n2. Naviga verso il menu e il sistema desiderato tramite gli elenchi a discesa.\n3. Spunta i giochi da eliminare nell'elenco.\n4. Clicca su 'ELIMINA SELEZIONE'.",
    "PT": "GameRemoval facilita a eliminação limpa de jogos da sua interface Collection (RetroFE).\n\nFuncionalidades:\n- Navegação Hierárquica: Percorre as suas coleções por categoria (Main) e por sistema.\n- Seleção Visual: Exibe a lista de jogos presentes na pasta ROM do sistema escolhido.\n- Eliminação Completa: Elimina o ficheiro de jogo (ROM) E os seus media associados (imagens, vídeos) para não deixar órfãos.\n- Segurança: Pede confirmação antes da eliminação definitiva.\n\nUtilização:\n1. Selecione a pasta base da sua instalação.\n2. Navegue para o menu e sistema desejado através das listas suspensas.\n3. Marque os jogos a eliminar na lista.\n4. Clique em 'ELIMINAR SELEÇÃO'."
  },
  "HyperlistGamelist": {
    "FR": "L'outil inverse de GamelistHyperlist. Convertit une base de données RetroFE (HyperList XML) vers le format Gamelist.xml standard (RetroBat).\n\nFonctionnalités :\n- Reconstruction : Crée un fichier 'gamelist.xml' complet à partir d'un XML RetroFE.\n- Adaptation des Chemins : Génère automatiquement les chemins de ROMs (avec l'extension de votre choix).\n- Récupération de Données : Restaure les noms, développeurs, dates de sortie et descriptions (si disponibles).\n- Migration Facilitée : Parfait pour basculer d'une configuration RetroFE vers RetroBat.\n\nUtilisation :\n1. HyperList XML : Sélectionnez le source.\n2. Extension ROM : Définissez l'extension des jeux ciblés (ex: .zip).\n3. Output Dir : Dossier de sortie.\n4. Cliquez sur 'CONVERTIR'.",
    "EN": "The reverse tool of GamelistHyperlist. Converts a RetroFE (HyperList XML) database to standard Gamelist.xml format (RetroBat).\n\nFeatures:\n- Reconstruction: Creates a complete 'gamelist.xml' from a RetroFE XML.\n- Path Adaptation: Automatically generates ROM paths (with your chosen extension).\n- Data Recovery: Restores names, developers, release dates, and descriptions (if available).\n- Easy Migration: Perfect for switching from a RetroFE setup to RetroBat.\n\nUsage:\n1. HyperList XML: Select source.\n2. ROM Extension: Define target game extension (ex: .zip).\n3. Output Dir: Output folder.\n4. Click 'CONVERT'.",
    "DE": "Das umgekehrte Werkzeug zu GamelistHyperlist. Konvertiert eine RetroFE-Datenbank (HyperList XML) in das Standard-Gamelist.xml-Format (RetroBat).\n\nFunktionen:\n- Rekonstruktion: Erstellt eine vollständige 'gamelist.xml' aus einer RetroFE-XML.\n- Pfad-Anpassung: Generiert automatisch ROM-Pfade (mit der Erweiterung Ihrer Wahl).\n- Datenwiederherstellung: Stellt Namen, Entwickler, Veröffentlichungsdaten und Beschreibungen (falls verfügbar) wieder her.\n- Einfache Migration: Perfekt für den Wechsel von einem RetroFE-Setup zu RetroBat.\n\nVerwendung:\n1. HyperList XML: Wählen Sie die Quelle.\n2. ROM-Erweiterung: Definieren Sie die Zielspielerweiterung (z.B. .zip).\n3. Ausgabeverzeichnis: Ausgabeordner.\n4. Klicken Sie auf 'KONVERTIEREN'.",
    "ES": "La herramienta inversa de GamelistHyperlist. Convierte una base de datos RetroFE (HyperList XML) al formato estándar Gamelist.xml (RetroBat).\n\nFuncionalidades:\n- Reconstrucción: Crea un archivo 'gamelist.xml' completo a partir de un XML RetroFE.\n- Adaptación de Rutas: Genera automáticamente las rutas de ROMs (con la extensión de tu elección).\n- Recuperación de Datos: Restaura nombres, desarrolladores, fechas de lanzamiento y descripciones (si están disponibles).\n- Migración Facilitada: Perfecto para cambiar de una configuración RetroFE a RetroBat.\n\nUso:\n1. HyperList XML: Selecciona la fuente.\n2. Extensión ROM: Define la extensión de los juegos objetivo (ej: .zip).\n3. Directorio de Salida: Carpeta de salida.\n4. Haz clic en 'CONVERTIR'.",
    "IT": "Lo strumento inverso di GamelistHyperlist. Converte un database RetroFE (HyperList XML) nel formato standard Gamelist.xml (RetroBat).\n\nFunzionalità:\n- Ricostruzione: Crea un file 'gamelist.xml' completo da un XML RetroFE.\n- Adattamento Percorsi: Genera automaticamente i percorsi ROM (con l'estensione scelta).\n- Recupero Dati: Ripristina nomi, sviluppatori, date di rilascio e descrizioni (se disponibili).\n- Migrazione Facilitata: Perfetto per passare da una configurazione RetroFE a RetroBat.\n\nUso:\n1. HyperList XML: Seleziona la sorgente.\n2. Estensione ROM: Definisci l'estensione dei giochi target (es: .zip).\n3. Output Dir: Cartella di output.\n4. Clicca su 'CONVERTI'.",
    "PT": "A ferramenta inversa do GamelistHyperlist. Converte uma base de dados RetroFE (HyperList XML) para o formato padrão Gamelist.xml (RetroBat).\n\nFuncionalidades:\n- Reconstrução: Cria um ficheiro 'gamelist.xml' completo a partir de um XML RetroFE.\n- Adaptação de Caminhos: Gera automaticamente os caminhos de ROMs (com a extensão da sua escolha).\n- Recuperação de Dados: Restaura nomes, estúdios, datas de lançamento e descrições (se disponíveis).\n- Migração Facilitada: Perfeito para mudar de uma configuração RetroFE para RetroBat.\n\nUtilização:\n1. HyperList XML: Selecione a fonte.\n2. Extensão ROM: Defina a extensão dos jogos alvo (ex: .zip).\n3. Output Dir: Pasta de saída.\n4. Clique em 'CONVERTER'."
  },
  "ImageConvert": {
    "FR": "ImageConvert est votre couteau suisse pour la conversion d'images par lot.\n\nFonctionnalités :\n- Support Étendu : Convertit depuis/vers WEBP, JPEG, PNG, TIFF, BMP, et formats plus rares (PPM, PGM...).\n- Traitement Parallèle : Utilise tous les cœurs CPU pour traiter des milliers d'images rapidement.\n- Option Suppression : Peut remplacer les originaux pour économiser de l'espace (ex: PNG -> JPG).\n- Robuste : Basé sur FFmpeg, capable de gérer des images corrompues ou des formats exotiques.\n\nUtilisation :\n1. Dossier Entrée : Contient vos images.\n2. Dossier Sortie : Où sauvegarder le résultat.\n3. Format Entrée : Le format à cibler (ex: png).\n4. Format Sortie : Le format désiré (ex: jpg).\n5. Cliquez sur 'CONVERTIR'.",
    "EN": "ImageConvert is your Swiss Army knife for batch image conversion.\n\nFeatures:\n- Extended Support: Converts from/to WEBP, JPEG, PNG, TIFF, BMP, and rarer formats (PPM, PGM...).\n- Parallel Processing: Uses all CPU cores to process thousands of images quickly.\n- Delete Option: Can replace originals to save space (ex: PNG -> JPG).\n- Robust: Based on FFmpeg, capable of handling corrupt images or exotic formats.\n\nUsage:\n1. Input Folder: Contains your images.\n2. Output Folder: Where to save the result.\n3. Input Format: The target format (ex: png).\n4. Output Format: The desired format (ex: jpg).\n5. Click 'CONVERT'.",
    "DE": "ImageConvert ist Ihr Schweizer Taschenmesser für die Stapelkonvertierung von Bildern.\n\nFunktionen:\n- Erweiterte Unterstützung: Konvertiert von/zu WEBP, JPEG, PNG, TIFF, BMP und selteneren Formaten (PPM, PGM...).\n- Parallelverarbeitung: Nutzt alle CPU-Kerne, um Tausende von Bildern schnell zu verarbeiten.\n- Löschoption: Kann Originale ersetzen, um Platz zu sparen (z.B. PNG -> JPG).\n- Robust: Basierend auf FFmpeg, fähig zum Umgang mit beschädigten Bildern oder exotischen Formaten.\n\nVerwendung:\n1. Eingabeordner: Enthält Ihre Bilder.\n2. Ausgabeordner: Wo das Ergebnis gespeichert werden soll.\n3. Eingabeformat: Das Zielformat (z.B. png).\n4. Ausgabeformat: Das gewünschte Format (z.B. jpg).\n5. Klicken Sie auf 'KONVERTIEREN'.",
    "ES": "ImageConvert es tu navaja suiza para la conversión de imágenes por lotes.\n\nFuncionalidades:\n- Soporte Extendido: Convierte desde/hacia WEBP, JPEG, PNG, TIFF, BMP, y formatos más raros (PPM, PGM...).\n- Procesamiento Paralelo: Utiliza todos los núcleos de CPU para procesar miles de imágenes rápidamente.\n- Opción Eliminación: Puede reemplazar los originales para ahorrar espacio (ej: PNG -> JPG).\n- Robusto: Basado en FFmpeg, capaz de gestionar imágenes corruptas o formatos exóticos.\n\nUso:\n1. Carpeta Entrada: Contiene tus imágenes.\n2. Carpeta Salida: Donde guardar el resultado.\n3. Formato Entrada: El formato a apuntar (ej: png).\n4. Formato Salida: El formato deseado (ej: jpg).\n5. Haz clic en 'CONVERTIR'.",
    "IT": "ImageConvert è il tuo coltellino svizzero per la conversione di immagini in batch.\n\nFunzionalità:\n- Supporto Esteso: Converte da/a WEBP, JPEG, PNG, TIFF, BMP, e formati più rari (PPM, PGM...).\n- Elaborazione Parallela: Utilizza tutti i core della CPU per elaborare migliaia di immagini rapidamente.\n- Opzione Eliminazione: Può sostituire gli originali per risparmiare spazio (es: PNG -> JPG).\n- Robusto: Basato su FFmpeg, capace di gestire immagini corrotte o formati esotici.\n\nUso:\n1. Cartella Input: Contiene le tue immagini.\n2. Cartella Output: Dove salvare il risultato.\n3. Formato Input: Il formato da puntare (es: png).\n4. Formato Output: Il formato desiderato (es: jpg).\n5. Clicca su 'CONVERTI'.",
    "PT": "ImageConvert é o seu canivete suíço para a conversão de imagens em lote.\n\nFuncionalidades:\n- Suporte Estendido: Converte de/para WEBP, JPEG, PNG, TIFF, BMP e formatos mais raros (PPM, PGM...).\n- Processamento Paralelo: Utiliza todos os núcleos do CPU para processar milhares de imagens rapidamente.\n- Opção de Eliminação: Pode substituir os originais para poupar espaço (ex: PNG -> JPG).\n- Robusto: Baseado no FFmpeg, capaz de lidar com imagens corrompidas ou formatos exóticos.\n\nUtilização:\n1. Pasta de Entrada: Contém as suas imagens.\n2. Pasta de Saída: Onde guardar o resultado.\n3. Formato de Entrada: O formato a visar (ex: png).\n4. Formato de Saída: O formato desejado (ex: jpg).\n5. Clique em 'CONVERTER'."
  },
  "PackWrapper": {
    "FR": "PackWrapper crée des paquets de différences (patchs) entre une configuration source et une base.\n\nFonctionnalités :\n- Comparaison : Ne garde que les fichiers nouveaux ou modifiés.\n- Modèles : Modes dédiés pour RetroBat et RetroFE (gestion intelligente des roms/media).\n- Sortie : Génère des ZIP ou des EXE auto-extraibles (SFX).\n\nUtilisation :\n1. Source : Votre dossier modifié.\n2. Type : Le dossier original (vide si nouveau).\n3. Cliquez sur 'Lancer'.",
    "EN": "PackWrapper creates difference packages (patches) between a source configuration and a base.\n\nFeatures:\n- Comparison: Keeps only new or modified files.\n- Templates: Dedicated modes for RetroBat and RetroFE (smart roms/media management).\n- Output: Generates ZIP or self-extracting EXE (SFX).\n\nUsage:\n1. Source: Your modified folder.\n2. Type: The original folder (empty if new).\n3. Click 'Launch'.",
    "DE": "PackWrapper erstellt Differenzpakete (Patches) zwischen einer Quellkonfiguration und einer Basis.\n\nFunktionen:\n- Vergleich: Behält nur neue oder geänderte Dateien bei.\n- Vorlagen: Dedizierte Modi für RetroBat und RetroFE (intelligente Roms/Medien-Verwaltung).\n- Ausgabe: Generiert ZIP oder selbstextrahierende EXE (SFX).\n\nVerwendung:\n1. Quelle: Ihr geänderter Ordner.\n2. Typ: Der Originalordner (leer, wenn neu).\n3. Klicken Sie auf 'Starten'.",
    "ES": "PackWrapper es una herramienta diseñada para crear paquetes de diferencias entre tu configuración actual (Fuente) y una configuración base (Tipo). Es ideal para generar parches de actualización o paquetes de contenido adicional para Retrobat o RetroFE.\n\nFuncionalidades:\n- Comparación Inteligente: Guarda solo los archivos nuevos o modificados.\n- Modos Dedicados:\n  - Estándar: Copia todo lo que es diferente.\n  - Retrobat: Separa inteligentemente el contenido (roms/saves) del sistema.\n  - RetroFE: Gestiona la estructura específica 'collections/<System>/roms'.\n- Formatos de Salida:\n  - ZIP estándar.\n  - EXE (SFX): Archivo auto-extraíble (requiere 7-Zip, descarga automática).\n- Manifiesto Externo: Genera un archivo .txt listando el contenido del paquete.\n\nUso:\n1. Carpeta Fuente (Modificada): Tu carpeta conteniendo tus adiciones/modificaciones.\n2. Carpeta Tipo (Original): La carpeta de referencia (vacía o versión anterior).\n3. Carpeta Destino: Donde guardar el paquete generado.\n4. Configuración:\n   - Selecciona el Modo (Estándar, Retrobat, RetroFE).\n   - Selecciona el Tipo (Base = archivos sistema, Content = roms/media).\n   - Selecciona el Formato (ZIP o EXE).\n5. Detalles: Dale un nombre y una descripción a tu paquete.\n6. ¡Lanza!\n\nNotas:\n- En modo EXE (SFX), la herramienta puede pedir descargar dependencias 7-Zip durante el primer uso.\n- El archivo \"manifest.txt\" generado acompaña al archivo para identificar su contenido sin abrirlo.\n",
    "IT": "PackWrapper è uno strumento progettato per creare pacchetti di differenze tra la tua configurazione attuale (Sorgente) e una configurazione base (Tipo). È ideale per generare patch di aggiornamento o pacchetti di contenuto aggiuntivo per Retrobat o RetroFE.\n\nFunzionalità:\n- Confronto Intelligente: Mantiene solo i file nuovi o modificati.\n- Modalità Dedicate:\n  - Standard: Copia tutto ciò che è diverso.\n  - Retrobat: Separa intelligentemente il contenuto (roms/saves) dal sistema.\n  - RetroFE: Gestisce la struttura specifica 'collections/<System>/roms'.\n- Formati di Uscita:\n  - ZIP standard.\n  - EXE (SFX): Archivio auto-estraente (richiede 7-Zip, download automatico).\n- Manifesto Esterno: Genera un file .txt elencando il contenuto del pacchetto.\n\nUso:\n1. Cartella Sorgente (Modificata): La tua cartella contenente le tue aggiunte/modifiche.\n2. Cartella Tipo (Originale): La cartella di riferimento (vuota o versione precedente).\n3. Cartella Destinazione: Dove salvare il pacchetto generato.\n4. Configurazione:\n   - Seleziona la Modalità (Standard, Retrobat, RetroFE).\n   - Seleziona il Tipo (Base = file sistema, Content = roms/media).\n   - Seleziona il Formato (ZIP o EXE).\n5. Dettagli: Dai un nome e una descrizione al tuo pacchetto.\n6. Lancia!\n\nNote:\n- In modalità EXE (SFX), lo strumento può chiedere di scaricare dipendenze 7-Zip durante il primo utilizzo.\n- Il file \"manifest.txt\" generato accompagna l'archivio per identificare il suo contenuto senza aprirlo.\n",
    "PT": "PackWrapper cria pacotes de diferenças (patches) entre uma configuração fonte e uma base.\n\nFuncionalidades:\n- Comparação: Mantém apenas os ficheiros novos ou modificados.\n- Modelos: Modos dedicados para RetroBat e RetroFE (gestão inteligente de roms/media).\n- Saída: Gera ZIP ou EXE auto-extraíveis (SFX).\n\nUtilização:\n1. Fonte: A sua pasta modificada.\n2. Tipo: A pasta original (vazia se nova).\n3. Clique em 'VAI'."
  },
  "PatternCopier": {
    "FR": "PatternCopier extrait des fichiers d'une arborescence complexe en suivant le modèle d'un fichier témoin.\n\nFonctionnalités :\n- Reconstruction : Reproduit l'arborescence source pour les fichiers trouvés.\n- Modèle Témoin : Cherche un fichier spécifique (ex: 'fanart.jpg') dans tous les sous-dossiers.\n- Mode Strict : Vérifie la profondeur et la structure pour éviter les faux positifs.\n- Efficace : Idéal pour extraire un type précis d'artwork d'un Full Set.\n\nUtilisation :\n1. Fichier Témoin : Sélectionnez un exemple du fichier à chercher.\n2. Dossier Source : Racine à scanner.\n3. Destination : Dossier d'export.\n4. Cliquez sur 'Démarrer la Copie'.",
    "EN": "PatternCopier extracts files from a complex tree following the pattern of a witness file.\n\nFeatures:\n- Reconstruction: Reproduces the source tree for found files.\n- Witness Model: Searches for a specific file (ex: 'fanart.jpg') in all subfolders.\n- Strict Mode: Checks depth and structure to avoid false positives.\n- Efficient: Ideal for extracting a precise type of artwork from a Full Set.\n\nUsage:\n1. Witness File: Select an example of the file to search.\n2. Source Folder: Root to scan.\n3. Destination: Export folder.\n4. Click 'Start Copy'.",
    "DE": "PatternCopier extrahiert Dateien aus einem komplexen Baum nach dem Muster einer Zeugendatei.\n\nFunktionen:\n- Rekonstruktion: Reproduziert den Quellbaum für gefundene Dateien.\n- Zeugenmodell: Sucht nach einer bestimmten Datei (z.B. 'fanart.jpg') in allen Unterordnern.\n- Strenger Modus: Überprüft Tiefe und Struktur, um falsch positive Ergebnisse zu vermeiden.\n- Effizient: Ideal zum Extrahieren eines bestimmten Artwork-Typs aus einem Full Set.\n\nVerwendung:\n1. Zeugendatei: Wählen Sie ein Beispiel der zu suchenden Datei.\n2. Quellordner: Zu scannender Stamm.\n3. Ziel: Exportordner.\n4. Klicken Sie auf 'Kopie starten'.",
    "ES": "PatternCopier extrae archivos de un árbol complejo siguiendo el modelo de un archivo testigo.\n\nFuncionalidades:\n- Reconstrucción: Reproduce el árbol fuente para los archivos encontrados.\n- Modelo Testigo: Busca un archivo específico (ej: 'fanart.jpg') en todas las subcarpetas.\n- Modo Estricto: Verifica la profundidad y la estructura para evitar falsos positivos.\n- Eficiente: Ideal para extraer un tipo preciso de artwork de un Full Set.\n\nUso:\n1. Archivo Testigo: Selecciona un ejemplo del archivo a buscar.\n2. Carpeta Fuente: Raíz a escanear.\n3. Destino: Carpeta de exportación.\n4. Haz clic en 'Iniciar Copia'.",
    "IT": "PatternCopier estrae file da un albero complesso seguendo il modello di un file testimone.\n\nFunzionalità:\n- Ricostruzione: Riproduce l'albero sorgente per i file trovati.\n- Modello Testimone: Cerca un file specifico (es: 'fanart.jpg') in tutte le sottocartelle.\n- Modalità Rigorosa: Controlla profondità e struttura per evitare falsi positivi.\n- Efficiente: Ideale per estrarre un tipo preciso di artwork da un Full Set.\n\nUso:\n1. File Testimone: Seleziona un esempio del file da cercare.\n2. Cartella Sorgente: Radice da scansionare.\n3. Destinazione: Cartella di esportazione.\n4. Clicca su 'Avvia Copia'.",
    "PT": "PatternCopier extrai ficheiros de uma árvore complexa seguindo o modelo de um ficheiro testemunha.\n\nFuncionalidades:\n- Reconstrução: Reproduz a árvore fonte para os ficheiros encontrados.\n- Modelo Testemunha: Procura um ficheiro específico (ex: 'fanart.jpg') em todas as subpastas.\n- Modo Estrito: Verifica a profundidade e estrutura para evitar falsos positivos.\n- Eficiente: Ideal para extrair um tipo preciso de artwork de um Full Set.\n\nUtilização:\n1. Ficheiro Testemunha: Selecione um exemplo do ficheiro a procurar.\n2. Pasta Fonte: Raiz a analisar.\n3. Destino: Pasta de exportação.\n4. Clique em 'Iniciar Cópia'."
  },
  "StoryCleaner": {
    "FR": "StoryCleaner normalise vos fichiers textes (synopsis) pour une compatibilité maximale.\n\nFonctionnalités :\n- Nettoyage Unicode : Remplace les caractères spéciaux (œ, æ, ç...) par leurs équivalents ASCII (oe, ae, c...).\n- Formatage : Supprime les symboles problématiques pour certains thèmes RetroFE/RetroBat.\n- Batch : Traite dossier et sous-dossiers en un passage.\n- Indispensable : Pour corriger les problèmes d'affichage de texte dans les vieilles interfaces.\n\nUtilisation :\n1. Sélectionnez le dossier contenant les .txt.\n2. Cochez 'Sous-dossiers' si nécessaire.\n3. Cliquez sur 'NORMALISER'.",
    "EN": "StoryCleaner normalizes your text files (synopses) for maximum compatibility.\n\nFeatures:\n- Unicode Cleaning: Replaces special characters (œ, æ, ç...) with ASCII equivalents (oe, ae, c...).\n- Formatting: Removes symbols problematic for some RetroFE/RetroBat themes.\n- Batch: Processes folder and subfolders in one pass.\n- Essential: To fix text display issues in old interfaces.\n\nUsage:\n1. Select folder containing .txt files.\n2. Check 'Subfolders' if necessary.\n3. Click 'NORMALIZE'.",
    "DE": "StoryCleaner normalisiert Ihre Textdateien (Synopsen) für maximale Kompatibilität.\n\nFunktionen:\n- Unicode-Bereinigung: Ersetzt Sonderzeichen (œ, æ, ç...) durch ihre ASCII-Äquivalente (oe, ae, c...).\n- Formatierung: Entfernt Symbole, die für einige RetroFE/RetroBat-Themen problematisch sind.\n- Batch: Verarbeitet Ordner und Unterordner in einem Durchgang.\n- Essenziell: Zur Behebung von Textanzeigeproblemen in alten Oberflächen.\n\nVerwendung:\n1. Wählen Sie den Ordner mit den .txt-Dateien.\n2. Markieren Sie bei Bedarf 'Unterordner'.\n3. Klicken Sie auf 'NORMALISIEREN'.",
    "ES": "StoryCleaner normaliza tus archivos de texto (sinopsis) para una compatibilidad máxima.\n\nFuncionalidades:\n- Limpieza Unicode: Reemplaza caracteres especiales (œ, æ, ç...) por sus equivalentes ASCII (oe, ae, c...).\n- Formateo: Elimina símbolos problemáticos para algunos temas RetroFE/RetroBat.\n- Batch: Procesa carpeta y subcarpetas en una pasada.\n- Esencial: Para corregir problemas de visualización de texto en interfaces antiguas.\n\nUso:\n1. Selecciona la carpeta que contiene los .txt.\n2. Marca 'Subcarpetas' si es necesario.\n3. Haz clic en 'NORMALIZAR'.",
    "IT": "StoryCleaner normalizza i tuoi file di testo (sinossi) per una compatibilità massima.\n\nFunzionalità:\n- Pulizia Unicode: Sostituisce i caratteri speciali (œ, æ, ç...) con i loro equivalenti ASCII (oe, ae, c...).\n- Formattazione: Rimuove simboli problematici per alcuni temi RetroFE/RetroBat.\n- Batch: Elabora cartella e sottocartelle in un passaggio.\n- Essenziale: Per correggere problemi di visualizzazione del testo nelle vecchie interfacce.\n\nUso:\n1. Seleziona la cartella contenente i .txt.\n2. Spunta 'Sottocartelle' se necessario.\n3. Clicca su 'NORMALIZZARE'.",
    "PT": "StoryCleaner normaliza os seus ficheiros de texto (sinopses) para compatibilidade máxima.\n\nFuncionalidades:\n- Limpeza Unicode: Substitui os caracteres especiais (œ, æ, ç...) pelos seus equivalentes ASCII (oe, ae, c...).\n- Formatação: Remove símbolos problemáticos para alguns temas RetroFE/RetroBat.\n- Batch: Processa pasta e subpastas numa só passagem.\n- Essencial: Para corrigir problemas de visualização de texto nas interfaces antigas.\n\nUtilização:\n1. Selecione a pasta que contém os .txt.\n2. Marque 'Subpastas' se necessário.\n3. Clique em 'NORMALIZAR'."
  },
  "StoryHyperlist": {
    "FR": "StoryHyperlist fusionne vos fichiers textes (synopsis) dans vos listes RetroFE.\n\nFonctionnalités :\n- Fusion Intelligente : Injecte le contenu des .txt dans les balises <story> du XML RetroFE correspondant.\n- Matching : Associe par nom de fichier (Game.txt -> <game name=\"Game\">).\n- Enrichissement : Complète votre liste existante sans écraser les autres données.\n- Utile : Pour réintégrer des synopsis après un nettoyage avec StoryCleaner.\n\nUtilisation :\n1. XML : Sélectionnez votre fichier XML RetroFE.\n2. Story Dir : Dossier contenant les .txt.\n3. Cliquez sur 'FUSIONNER'.",
    "EN": "StoryHyperlist merges your text files (synopses) into your RetroFE lists.\n\nFeatures:\n- Smart Merge: Injects .txt content into <story> tags of the corresponding RetroFE XML.\n- Matching: Associates by filename (Game.txt -> <game name=\"Game\">).\n- Enrichment: Completes your existing list without overwriting other data.\n- Useful: To reintegrate synopses after cleaning with StoryCleaner.\n\nUsage:\n1. XML: Select your RetroFE XML file.\n2. Story Dir: Folder containing .txt files.\n3. Click 'MERGE'.",
    "DE": "StoryHyperlist führt Ihre Textdateien (Synopsen) in Ihre RetroFE-Listen zusammen.\n\nFunktionen:\n- Intelligente Zusammenführung: Injiziert .txt-Inhalt in <story>-Tags des entsprechenden RetroFE-XML.\n- Abgleich: Ordnet nach Dateiname zu (Game.txt -> <game name=\"Game\">).\n- Anreicherung: Vervollständigt Ihre bestehende Liste, ohne andere Daten zu überschreiben.\n- Nützlich: Zum Reintegrieren von Synopsen nach der Bereinigung mit StoryCleaner.\n\nVerwendung:\n1. XML: Wählen Sie Ihre RetroFE-XML-Datei.\n2. Story-Verzeichnis: Ordner mit .txt-Dateien.\n3. Klicken Sie auf 'ZUSAMMENFÜHREN'.",
    "ES": "StoryHyperlist fusiona tus archivos de texto (sinopsis) en tus listas RetroFE.\n\nFuncionalidades:\n- Fusión Inteligente: Inyecta el contenido de los .txt en las etiquetas <story> del XML RetroFE correspondiente.\n- Coincidencia: Asocia por nombre de archivo (Game.txt -> <game name=\"Game\">).\n- Enriquecimiento: Completa tu lista existente sin sobrescribir otros datos.\n- Útil: Para reintegrar sinopsis después de una limpieza con StoryCleaner.\n\nUso:\n1. XML: Selecciona tu archivo XML RetroFE.\n2. Directorio Story: Carpeta que contiene los .txt.\n3. Haz clic en 'FUSIONAR'.",
    "IT": "StoryHyperlist unisce i tuoi file di testo (sinossi) nelle tue liste RetroFE.\n\nFunzionalità:\n- Unione Intelligente: Inietta il contenuto dei .txt nei tag <story> dell'XML RetroFE corrispondente.\n- Corrispondenza: Associa per nome file (Game.txt -> <game name=\"Game\">).\n- Arricchimento: Completa la tua lista esistente senza sovrascrivere altri dati.\n- Utile: Per reintegrare sinossi dopo una pulizia con StoryCleaner.\n\nUso:\n1. XML: Seleziona il tuo file XML RetroFE.\n2. Story Dir: Cartella contenente i .txt.\n3. Clicca su 'UNIRE'.",
    "PT": "StoryHyperlist funde os seus ficheiros de texto (sinopses) nas suas listas RetroFE.\n\nFuncionalidades:\n- Fusão Inteligente: Injeta o conteúdo dos .txt nas etiquetas <story> do XML RetroFE correspondente.\n- Correspondência: Associa por nome de ficheiro (Game.txt -> <game name=\"Game\">).\n- Enriquecimento: Completa a sua lista existente sem sobrescrever outros dados.\n- Útil: Para reintegrar sinopses após uma limpeza com StoryCleaner.\n\nUtilização:\n1. XML: Selecione o seu ficheiro XML RetroFE.\n2. Story Dir: Pasta contendo os .txt.\n3. Clique em 'FUNDIR'."
  },
  "SystemsExtractor": {
    "FR": "SystemsExtractor compare votre 'es_systems.cfg' avec la base officielle RetroBat.\n\nFonctionnalités :\n- Téléchargement Auto : Récupère la dernière version officielle de es_systems.cfg depuis GitHub.\n- Comparaison : Identifie les systèmes personnalisés (non présents dans l'officiel).\n- Extraction : Génère des fichiers .cfg individuels (es_systems_PS2.cfg) pour chaque système unique.\n- Portable : Idéal pour sauvegarder vos configurations systèmes avant une mise à jour de RetroBat.\n\nUtilisation :\n1. Custom CFG : Votre fichier es_systems.cfg actuel.\n2. Out Dir : Dossier de sauvegarde.\n3. Cliquez sur 'PROCESSER'.",
    "EN": "SystemsExtractor compares your 'es_systems.cfg' with the official RetroBat base.\n\nFeatures:\n- Auto Download: Retrieves the latest official es_systems.cfg from GitHub.\n- Comparison: Identifies custom systems (not present in official).\n- Extraction: Generates individual .cfg files (es_systems_PS2.cfg) for each unique system.\n- Portable: Ideal for saving your system configurations before a RetroBat update.\n\nUsage:\n1. Custom CFG: Your current es_systems.cfg file.\n2. Out Dir: Backup folder.\n3. Click 'PROCESS'.",
    "DE": "SystemsExtractor vergleicht Ihre 'es_systems.cfg' mit der offiziellen RetroBat-Basis.\n\nFunktionen:\n- Auto-Download: Ruft die neueste offizielle es_systems.cfg von GitHub ab.\n- Vergleich: Identifiziert benutzerdefinierte Systeme (nicht im offiziellen vorhanden).\n- Extraktion: Generiert individuelle .cfg-Dateien (es_systems_PS2.cfg) für jedes einzigartige System.\n- Portabel: Ideal zum Sichern Ihrer Systemkonfigurationen vor einem RetroBat-Update.\n\nVerwendung:\n1. Custom CFG: Ihre aktuelle es_systems.cfg-Datei.\n2. Out Dir: Sicherungsordner.\n3. Klicken Sie auf 'VERARBEITEN'.",
    "ES": "SystemsExtractor compara tu 'es_systems.cfg' con la base oficial RetroBat.\n\nFuncionalidades:\n- Descarga Auto: Recupera la última versión oficial de es_systems.cfg desde GitHub.\n- Comparación: Identifica los sistemas personalizados (no presentes en el oficial).\n- Extracción: Genera archivos .cfg individuales (es_systems_PS2.cfg) para cada sistema único.\n- Portable: Ideal para guardar tus configuraciones de sistemas antes de una actualización de RetroBat.\n\nUso:\n1. Custom CFG: Tu archivo es_systems.cfg actual.\n2. Directorio Salida: Carpeta de respaldo.\n3. Haz clic en 'PROCESAR'.",
    "IT": "SystemsExtractor confronta il tuo 'es_systems.cfg' con la base ufficiale RetroBat.\n\nFunzionalità:\n- Download Auto: Recupera l'ultima versione ufficiale di es_systems.cfg da GitHub.\n- Confronto: Identifica i sistemi personalizzati (non presenti nell'ufficiale).\n- Estrazione: Genera file .cfg individuali (es_systems_PS2.cfg) per ogni sistema unico.\n- Portatile: Ideale per salvare le configurazioni di sistema prima di un aggiornamento di RetroBat.\n\nUso:\n1. Custom CFG: Il tuo file es_systems.cfg attuale.\n2. Output Dir: Cartella di backup.\n3. Clicca su 'PROCESSARE'.",
    "PT": "SystemsExtractor compara o seu 'es_systems.cfg' com a base oficial RetroBat.\n\nFuncionalidades:\n- Download Auto: Descarrega a última versão oficial do es_systems.cfg a partir do GitHub.\n- Comparação: Identifica os sistemas personalizados (não presentes no oficial).\n- Extração: Gera ficheiros .cfg individuais (es_systems_PS2.cfg) para cada sistema único.\n- Portátil: Ideal para salvaguardar as suas configurações de sistema antes de uma atualização do RetroBat.\n\nUtilização:\n1. Custom CFG: O seu ficheiro es_systems.cfg atual.\n2. Output Dir: Pasta de backup.\n3. Clique em 'PROCESSAR'."
  },
  "UniversalRomCleaner": {
    "FR": "UniversalRomCleaner est votre assistant de maintenance pour collections ROMs.\n\nFonctionnalités :\n- Tri 1G1R (One Game One ROM) : Garde une seule version par jeu selon vos priorités (ex: France > Europe > USA).\n- Interface Visuelle : Glissez-déposez pour définir l'ordre de priorité des tags (langue, région).\n- Mode Dossier : Nettoie et organise sans 1G1R (suppression tags indésirables, tri par région).\n- Simulation : Prévisualisez toutes les actions (suppressions, déplacements) sans risque.\n\nUtilisation :\n1. Sélectionnez le dossier ROMs.\n2. Définissez l'ordre (ex: FR > EU > US).\n3. Glissez les tags indésirables (ex: Beta, Demo) dans 'Supprimer'.\n4. Cliquez sur 'SIMULATION' puis 'NETTOYER'.",
    "EN": "UniversalRomCleaner is your maintenance assistant for ROM collections.\n\nFeatures:\n- 1G1R Sort (One Game One ROM): Keeps a single version per game according to your priorities (ex: France > Europe > USA).\n- Visual Interface: Drag & drop to define tag priority order (language, region).\n- Folder Mode: Cleans and organizes without 1G1R (delete unwanted tags, sort by region).\n- Simulation: Preview all actions (deletions, moves) without risk.\n\nUsage:\n1. Select ROMs folder.\n2. Define order (ex: FR > EU > US).\n3. Drag unwanted tags (ex: Beta, Demo) into 'Delete'.\n4. Click 'SIMULATION' then 'CLEAN'.",
    "DE": "UniversalRomCleaner ist Ihr Wartungsassistent für ROM-Sammlungen.\n\nFunktionen:\n- 1G1R-Sortierung (One Game One ROM): Behält eine einzelne Version pro Spiel gemäß Ihren Prioritäten (z.B. Frankreich > Europa > USA).\n- Visuelle Oberfläche: Drag & Drop zum Definieren der Tag-Prioritätsreihenfolge (Sprache, Region).\n- Ordner-Modus: Bereinigt und organisiert ohne 1G1R (Löschen unerwünschter Tags, Sortieren nach Region).\n- Simulation: Vorschau aller Aktionen (Löschungen, Verschiebungen) ohne Risiko.\n\nVerwendung:\n1. Wählen Sie den ROM-Ordner.\n2. Definieren Sie die Reihenfolge (z.B. FR > EU > US).\n3. Ziehen Sie unerwünschte Tags (z.B. Beta, Demo) in 'Löschen'.\n4. Klicken Sie auf 'SIMULATION' dann 'BEREINIGEN'.",
    "ES": "UniversalRomCleaner es tu asistente de mantenimiento para colecciones ROMs.\n\nFuncionalidades:\n- Clasificación 1G1R (One Game One ROM): Guarda una sola versión por juego según tus prioridades (ej: Francia > Europa > USA).\n- Interfaz Visual: Arrastrar y soltar para definir el orden de prioridad de las etiquetas (idioma, región).\n- Modo Carpeta: Limpia y organiza sin 1G1R (eliminación etiquetas no deseadas, clasificación por región).\n- Simulación: Previsualiza todas las acciones (eliminaciones, movimientos) sin riesgo.\n\nUso:\n1. Selecciona la carpeta ROMs.\n2. Define el orden (ej: FR > EU > US).\n3. Arrastra las etiquetas no deseadas (ej: Beta, Demo) en 'Eliminar'.\n4. Haz clic en 'SIMULACIÓN' luego 'LIMPIAR'.",
    "IT": "UniversalRomCleaner è il tuo assistente di manutenzione per collezioni ROM.\n\nFunzionalità:\n- Ordinamento 1G1R (One Game One ROM): Mantiene una singola versione per gioco secondo le tue priorità (es: Francia > Europa > USA).\n- Interfaccia Visiva: Drag & drop per definire l'ordine di priorità dei tag (lingua, regione).\n- Modalità Cartella: Pulisce e organizza senza 1G1R (eliminazione tag indesiderati, ordinamento per regione).\n- Simulazione: Anteprima di tutte le azioni (eliminazioni, spostamenti) senza rischio.\n\nUso:\n1. Seleziona la cartella ROM.\n2. Definisci l'ordine (es: FR > EU > US).\n3. Trascina i tag indesiderati (es: Beta, Demo) in 'Elimina'.\n4. Clicca su 'SIMULAZIONE' poi 'PULIRE'.",
    "PT": "UniversalRomCleaner é o seu assistente de manutenção para coleções de ROMs.\n\nFuncionalidades:\n- Ordenação 1G1R (One Game One ROM): Mantém uma única versão por jogo de acordo com as suas prioridades (ex: França > Europa > EUA).\n- Interface Visual: Arraste e largue para definir a ordem de prioridade das etiquetas (língua, região).\n- Modo Pasta: Limpa e organiza sem 1G1R (eliminação de etiquetas indesejadas, ordenação por região).\n- Simulação: Pré-visualize todas as ações (eliminações, movimentos) sem risco.\n\nUtilização:\n1. Selecione a pasta ROMs.\n2. Defina a ordem (ex: FR > EU > US).\n3. Arraste as etiquetas indesejadas (ex: Beta, Demo) para 'Eliminar'.\n4. Clique em 'SIMULAÇÃO' depois em 'LIMPAR'."
  },
  "VideoConvert": {
    "FR": "VideoConvert convertit et optimise vos vidéos pour le rétrogaming.\n\nFonctionnalités :\n- Batch : Traite des dossiers entiers de vidéos (snaps).\n- Optimisation : Préréglages pour réduire la taille sans perte visible (H264/H265).\n- Trim : Coupe le début/fin des vidéos (ex: supprimer les intros).\n- Capture : Génère automatiquement une image (boxart/fanart) à partir de la vidéo.\n\nUtilisation :\n1. Ajoutez vos fichiers vidéo.\n2. Réglez coupe (Début/Fin) si besoin.\n3. Choisissez le format/qualité.\n4. Cliquez sur 'CONVERTIR'.",
    "EN": "VideoConvert converts and optimizes your videos for retrogaming.\n\nFeatures:\n- Batch: Processes entire video folders (snaps).\n- Optimization: Presets to reduce size without visible loss (H264/H265).\n- Trim: Cuts start/end of videos (ex: remove intros).\n- Capture: Automatically generates an image (boxart/fanart) from the video.\n\nUsage:\n1. Add your video files.\n2. Set trim (Start/End) if needed.\n3. Choose format/quality.\n4. Click 'CONVERT'.",
    "DE": "VideoConvert konvertiert und optimiert Ihre Videos für Retrogaming.\n\nFunktionen:\n- Batch: Verarbeitet ganze Videoordner (Snaps).\n- Optimierung: Voreinstellungen zur Reduzierung der Größe ohne sichtbaren Verlust (H264/H265).\n- Trimmen: Schneidet Anfang/Ende von Videos (z.B. Intros entfernen).\n- Aufnahme: Generiert automatisch ein Bild (Boxart/Fanart) aus dem Video.\n\nVerwendung:\n1. Fügen Sie Ihre Videodateien hinzu.\n2. Stellen Sie Schnitt (Start/Ende) bei Bedarf ein.\n3. Wählen Sie Format/Qualität.\n4. Klicken Sie auf 'KONVERTIEREN'.",
    "ES": "VideoConvert convierte y optimiza tus videos para retrogaming.\n\nFuncionalidades:\n- Batch: Procesa carpetas enteras de videos (snaps).\n- Optimización: Preajustes para reducir el tamaño sin pérdida visible (H264/H265).\n- Trim: Corta el inicio/fin de los videos (ej: eliminar intros).\n- Captura: Genera automáticamente una imagen (boxart/fanart) a partir del video.\n\nUso:\n1. Añade tus archivos de video.\n2. Ajusta corte (Inicio/Fin) si es necesario.\n3. Elige el formato/calidad.\n4. Haz clic en 'CONVERTIR'.",
    "IT": "VideoConvert converte e ottimizza i tuoi video per il retrogaming.\n\nFunzionalità:\n- Batch: Elabora intere cartelle di video (snaps).\n- Ottimizzazione: Preimpostazioni per ridurre la dimensione senza perdita visibile (H264/H265).\n- Trim: Taglia l'inizio/fine dei video (es: rimuovere intro).\n- Cattura: Genera automaticamente un'immagine (boxart/fanart) dal video.\n\nUso:\n1. Aggiungi i tuoi file video.\n2. Imposta taglio (Inizio/Fine) se necessario.\n3. Scegli formato/qualità.\n4. Clicca su 'CONVERTI'.",
    "PT": "VideoConvert converte e otimiza os seus vídeos para retrogaming.\n\nFuncionalidades:\n- Batch: Processa pastas inteiras de vídeos (snaps).\n- Otimização: Predefinições para reduzir o tamanho sem perda visível (H264/H265).\n- Trim: Corta o início/fim dos vídeos (ex: remover intros).\n- Captura: Gera automaticamente uma imagem (boxart/fanart) a partir do vídeo.\n\nUtilização:\n1. Adicione os seus ficheiros de vídeo.\n2. Defina o corte (Início/Fim) se necessário.\n3. Escolha o formato/qualidade.\n4. Clique em 'CONVERTER'."
  },
  "YTDownloader": {
    "FR": "Sauvegardez vos contenus YouTube préférés sans toucher à une ligne de commande. Ce module offre une interface graphique moderne et intuitive pour piloter le puissant moteur yt-dlp. Il gère automatiquement l'installation des composants nécessaires au premier lancement pour être opérationnel immédiatement.\nQue vous souhaitiez télécharger une vidéo unique, une playlist entière ou tout le contenu d'une chaîne, il vous suffit de coller le lien. L'outil vous laisse le choix des armes : extrayez uniquement l'audio en MP3 , ou récupérez la vidéo dans sa meilleure qualité possible (jusqu'en 4K). Il intègre même un mode \"Copie Rapide\" intelligent qui assemble l'image et le son en quelques secondes, vous évitant les longs temps de ré-encodage.",
    "DE": "Speichern Sie Ihre Lieblings-YouTube-Inhalte, ohne eine Befehlszeile zu berühren. Dieses Modul bietet eine moderne und intuitive grafische Oberfläche zur Steuerung der leistungsstarken yt-dlp-Engine. Es verwaltet automatisch die Installation der erforderlichen Komponenten beim ersten Start, um sofort einsatzbereit zu sein.\nEgal, ob Sie ein einzelnes Video, eine ganze Playlist oder den gesamten Inhalt eines Kanals herunterladen möchten, fügen Sie einfach den Link ein. Das Tool lässt Ihnen die Wahl der Waffen: Extrahieren Sie nur das Audio im MP3-Format oder rufen Sie das Video in der bestmöglichen Qualität (bis zu 4K) ab. Es integriert sogar einen intelligenten \"Schnellkopie\"-Modus, der Bild und Ton in wenigen Sekunden zusammenfügt und Ihnen lange Neukodierungszeiten erspart.",
    "EN": "Save your favorite YouTube content without touching a command line. This module offers a modern and intuitive graphical interface to drive the powerful yt-dlp engine. It automatically manages installation of necessary components at first launch to be operational immediately.\nWhether you wish to download a single video, an entire playlist or a whole channel content, simply paste the link. The tool leaves you the choice of weapons: extract only audio in MP3, or retrieve video in its best possible quality (up to 4K). It even integrates a smart \"Quick Copy\" mode which assembles image and sound in a few seconds, avoiding long re-encoding times.",
    "ES": "Guarda tus contenidos favoritos de YouTube sin tocar una línea de comando. Este módulo ofrece una interfaz gráfica moderna e intuitiva para pilotar el potente motor yt-dlp. Gestiona automáticamente la instalación de los componentes necesarios en el primer lanzamiento para estar operativo inmediatamente.\nYa desees descargar un video único, una lista de reproducción entera o todo el contenido de un canal, solo tienes que pegar el enlace. La herramienta te deja la elección de las armas: extrae solo el audio en MP3, o recupera el video en su mejor calidad posible (hasta 4K). Integra incluso un modo \"Copia Rápida\" inteligente que ensambla imagen y sonido en unos segundos, evitándote los largos tiempos de re-codificación.",
    "IT": "Salva i tuoi contenuti YouTube preferiti senza toccare una riga di comando. Questo modulo offre un'interfaccia grafica moderna e intuitiva per pilotare il potente motore yt-dlp. Gestisce automaticamente l'installazione dei componenti necessari al primo avvio per essere operativo immediatamente.\nChe tu voglia scaricare un video singolo, una playlist intera o tutto il contenuto di un canale, basta incollare il link. Lo strumento ti lascia la scelta delle armi: estrai solo l'audio in MP3, o recupera il video nella sua migliore qualità possibile (fino a 4K). Integra anche una modalità \"Copia Rapida\" intelligente che assembla immagine e suono in pochi secondi, evitandoti i lunghi tempi di ricodifica.",
    "PT": "Guarde os seus conteúdos favoritos do YouTube sem tocar numa linha de comandos. Este módulo oferece uma interface gráfica moderna e intuitiva para controlar o poderoso motor yt-dlp. Gere automaticamente a instalação dos componentes necessários no primeiro arranque para estar operacional imediatamente.\nQuer deseje descarregar um vídeo único, uma playlist inteira ou todo o conteúdo de um canal, basta colar o link. A ferramenta dá-lhe a escolha das armas: extraia apenas o áudio em MP3, ou recupere o vídeo na sua melhor qualidade possível (até 4K). Integra até um modo \"Cópia Rápida\" inteligente que junta imagem e som em poucos segundos, poupando-lhe os longos tempos de recodificação."
  },
  "InstallDeps": {
    "FR": "InstallDeps configure votre environnement pour une compatibilité totale.\n\nFonctionnalités :\n- Installation Auto : Télécharge et installe les librairies Python manquantes.\n- Vérification Système : S'assure que FFmpeg, 7-Zip et autres outils tiers sont présents et accessibles.\n- Réparation : Corrige les chemins d'accès (PATH) corrompus ou manquants.\n- Indispensable : À lancer en premier cas de problème avec un autre module.",
    "EN": "InstallDeps configures your environment for total compatibility.\n\nFeatures:\n- Auto Install: Downloads and installs missing Python libraries.\n- System Check: Ensures FFmpeg, 7-Zip and other third-party tools are present and accessible.\n- Repair: Fixes corrupt or missing system PATHs.\n- Essential: Run this first if you encounter issues with another module.",
    "DE": "InstallDeps konfiguriert Ihre Umgebung für vollständige Kompatibilität.\n\nFunktionen:\n- Automatische Installation: Lädt fehlende Python-Bibliotheken herunter und installiert sie.\n- Systemprüfung: Stellt sicher, dass FFmpeg, 7-Zip und andere Tools von Drittanbietern vorhanden und zugänglich sind.\n- Reparatur: Behebt beschädigte oder fehlende Systempfade (PATH).\n- Essenziell: Führen Sie dies zuerst aus, wenn Sie Probleme mit einem anderen Modul haben.",
    "ES": "InstallDeps configura tu entorno para una compatibilidad total.\n\nFuncionalidades:\n- Instalación Auto: Descarga e instala las librerías Python faltantes.\n- Verificación Sistema: Se asegura de que FFmpeg, 7-Zip y otras herramientas de terceros estén presentes y accesibles.\n- Reparación: Corrige las rutas de acceso (PATH) corruptas o faltantes.\n- Esencial: Ejecutar primero en caso de problema con otro módulo.",
    "IT": "InstallDeps configura il tuo ambiente per una compatibilità totale.\n\nFunzionalità:\n- Installazione Auto: Scarica e installa le librerie Python mancanti.\n- Verifica Sistema: Assicura che FFmpeg, 7-Zip e altri strumenti di terze parti siano presenti e accessibili.\n- Riparazione: Corregge i percorsi di accesso (PATH) corrotti o mancanti.\n- Essenziale: Esegui per primo in caso di problemi con un altro modulo.",
    "PT": "InstallDeps configura o seu ambiente para compatibilidade total.\n\nFuncionalidades:\n- Instalação Auto: Descarrega e instala as bibliotecas Python em falta.\n- Verificação de Sistema: Assegura que FFmpeg, 7-Zip e outras ferramentas de terceiros estão presentes e acessíveis.\n- Reparação: Corrige os caminhos de acesso (PATH) corrompidos ou em falta.\n- Essencial: Executar primeiro em caso de problemas com outro módulo."
  },
  "ListFilesSimple": {
    "FR": "ListFilesSimple génère un inventaire rapide de vos fichiers.\n\nFonctionnalités :\n- Listing Rapide : Crée un fichier texte listant tout le contenu d'un dossier.\n- Format Clair : Une ligne par fichier, sans fioritures.\n- Utilité : Parfait pour partager une liste de jeux ou vérifier le contenu d'un disque dur.\n- Léger : Script instantané, même sur des milliers de fichiers.",
    "EN": "ListFilesSimple generates a quick inventory of your files.\n\nFeatures:\n- Quick Listing: Creates a text file listing all content of a folder.\n- Clear Format: One line per file, no frills.\n- Utility: Perfect for sharing a game list or checking hard drive content.\n- Lightweight: Instant script, even on thousands of files.",
    "DE": "ListFilesSimple generiert ein schnelles Inventar Ihrer Dateien.\n\nFunktionen:\n- Schnelle Auflistung: Erstellt eine Textdatei, die den gesamten Inhalt eines Ordners auflistet.\n- Klares Format: Eine Zeile pro Datei, ohne Schnickschnack.\n- Nützlichkeit: Perfekt zum Teilen einer Spieleliste oder zum Überprüfen des Festplatteninhalts.\n- Leichtgewichtig: Sofortiges Skript, auch bei Tausenden von Dateien.",
    "ES": "ListFilesSimple genera un inventario rápido de tus archivos.\n\nFuncionalidades:\n- Listado Rápido: Crea un archivo de texto listando todo el contenido de una carpeta.\n- Formato Claro: Una línea por archivo, sin adornos.\n- Utilidad: Perfecto para compartir una lista de juegos o verificar el contenido de un disco duro.\n- Ligero: Script instantáneo, incluso en miles de archivos.",
    "IT": "ListFilesSimple genera un inventario rapido dei tuoi file.\n\nFunzionalità:\n- Elenco Rapido: Crea un file di testo che elenca tutto il contenuto di una cartella.\n- Formato Chiaro: Una riga per file, senza fronzoli.\n- Utilità: Perfetto per condividere un elenco di giochi o controllare il contenuto di un disco rigido.\n- Leggero: Script istantaneo, anche su migliaia di file.",
    "PT": "ListFilesSimple gera um inventário rápido dos seus ficheiros.\n\nFuncionalidades:\n- Listagem Rápida: Cria um ficheiro de texto listando todo o conteúdo de uma pasta.\n- Formato Claro: Uma linha por ficheiro, sem floreados.\n- Utilidade: Perfeito para partilhar uma lista de jogos ou verificar o conteúdo de um disco rígido.\n- Leve: Script instantâneo, mesmo em milhares de ficheiros."
  },
  "ListFilesWin": {
    "FR": "ListFilesWin offre un inventaire détaillé et structuré de vos arborescences.\n\nFonctionnalités :\n- Scan Récursif : Parcourt les sous-dossiers pour une vision complète.\n- Détails Complets : Inclut la taille, la date de modification et le chemin complet de chaque fichier.\n- Export Structuré : Génère un rapport formaté facile à importer dans Excel.\n- Diagnostic : Idéal pour repérer les doublons ou les fichiers volumineux oubliés.",
    "EN": "ListFilesWin offers a detailed and structured inventory of your trees.\n\nFeatures:\n- Recursive Scan: Browses subfolders for a complete view.\n- Full Details: Includes size, modification date, and full path of each file.\n- Structured Export: Generates a formatted report easy to import into Excel.\n- Diagnostic: Ideal for spotting duplicates or forgotten large files.",
    "DE": "ListFilesWin bietet ein detailliertes und strukturiertes Inventar Ihrer Bäume.\n\nFunktionen:\n- Rekursiver Scan: Durchsucht Unterordner für eine vollständige Ansicht.\n- Volle Details: Enthält Größe, Änderungsdatum und vollständigen Pfad jeder Datei.\n- Strukturierter Export: Generiert einen formatierten Bericht, der einfach in Excel importiert werden kann.\n- Diagnose: Ideal zum Aufspüren von Duplikaten oder vergessenen großen Dateien.",
    "ES": "ListFilesWin ofrece un inventario detallado y estructurado de tus árboles.\n\nFuncionalidades:\n- Escaneo Recursivo: Recorre las subcarpetas para una visión completa.\n- Detalles Completos: Incluye el tamaño, la fecha de modificación y la ruta completa de cada archivo.\n- Exportación Estructurada: Genera un informe formateado fácil de importar en Excel.\n- Diagnóstico: Ideal para detectar duplicados o archivos voluminosos olvidados.",
    "IT": "ListFilesWin offre un inventario dettagliato e strutturato dei tuoi alberi.\n\nFunzionalità:\n- Scansione Ricorsiva: Sfoglia le sottocartelle per una visione completa.\n- Dettagli Completi: Include dimensione, data di modifica e percorso completo di ogni file.\n- Esportazione Strutturata: Genera un rapporto formattato facile da importare in Excel.\n- Diagnostica: Ideale per individuare duplicati o file voluminosi dimenticati.",
    "PT": "ListFilesWin oferece um inventário detalhado e estruturado das suas árvores de diretórios.\n\nFuncionalidades:\n- Análise Recursiva: Percorre as subpastas para uma visão completa.\n- Detalhes Completos: Inclui tamanho, data de modificação e caminho completo de cada ficheiro.\n- Exportação Estruturada: Gera um relatório formatado fácil de importar no Excel.\n- Diagnóstico: Ideal para detetar duplicados ou ficheiros volumosos esquecidos."
  },
  "LongPaths": {
    "FR": "LongPaths détecte les noms de fichiers trop longs qui bloquent vos copies.\n\nFonctionnalités :\n- Scanner de Limites : Identifie instantanément les chemins dépassant 260 caractères (limite Windows standard).\n- Prévention d'Erreurs : Vous évite les échecs de copie ou de sauvegarde incompréhensibles.\n- Rapport Précis : Fournit la liste exacte des fichiers incriminés pour correction manuelle ou automatique.\n- Essentiel : Avant de transférer une collection vers un disque externe ou un NAS.",
    "EN": "LongPaths detects filenames that are too long and block your copies.\n\nFeatures:\n- Limit Scanner: Instantly identifies paths exceeding 260 characters (standard Windows limit).\n- Error Prevention: Prevents incomprehensible copy or backup failures.\n- Precise Report: Provides the exact list of offending files for manual or automatic correction.\n- Essential: Before transferring a collection to an external drive or NAS.",
    "DE": "LongPaths erkennt zu lange Dateinamen, die Ihre Kopien blockieren.\n\nFunktionen:\n- Grenzscanner: Identifiziert sofort Pfade mit mehr als 260 Zeichen (Standard-Windows-Limit).\n- Fehlervermeidung: Verhindert unverständliche Kopier- oder Sicherungsfehler.\n- Genauer Bericht: Liefert die genaue Liste der betroffenen Dateien zur manuellen oder automatischen Korrektur.\n- Essenziell: Vor der Übertragung einer Sammlung auf ein externes Laufwerk oder NAS.",
    "ES": "LongPaths detecta los nombres de archivos demasiado largos que bloquean tus copias.\n\nFuncionalidades:\n- Escáner de Límites: Identifica instantáneamente las rutas que superan los 260 caracteres (límite estándar de Windows).\n- Prevención de Errores: Evita fallos de copia o de respaldo incomprensibles.\n- Informe Preciso: Proporciona la lista exacta de archivos incriminados para corrección manual o automática.\n- Esencial: Antes de transferir una colección a un disco externo o NAS.",
    "IT": "LongPaths rileva i nomi di file troppo lunghi che bloccano le tue copie.\n\nFunzionalità:\n- Scanner di Limiti: Identifica istantaneamente i percorsi che superano i 260 caratteri (limite standard Windows).\n- Prevenzione Errori: Evita fallimenti di copia o backup incomprensibili.\n- Rapporto Preciso: Fornisce l'elenco esatto dei file incriminati per correzione manuale o automatica.\n- Essenziale: Prima di trasferire una collezione su un disco esterno o NAS.",
    "PT": "LongPaths deteta nomes de ficheiros demasiado longos que bloqueiam as suas cópias.\n\nFuncionalidades:\n- Scanner de Limites: Identifica instantaneamente os caminhos que excedem 260 caracteres (limite padrão do Windows).\n- Prevenção de Erros: Evita falhas de cópia ou backup incompreensíveis.\n- Relatório Preciso: Fornece a lista exata dos ficheiros incriminados para correção manual ou automática.\n- Essencial: Antes de transferir uma coleção para um disco externo ou NAS."
  },
  "M3UCreator": {
    "FR": "M3UCreator automatise la gestion de vos jeux multi-disques (PS1, Dreamcast...).\n\nFonctionnalités :\n- Playlist Auto : Génère un fichier .m3u pour chaque jeu composé de plusieurs CD (.bin/.cue, .iso...).\n- Nettoyage Visuel : Permet de ne faire apparaître qu'une seule entrée par jeu dans votre frontend (RetroBat, ES).\n- Intelligent : Regroupe automatiquement les fichiers nommés 'Disc 1', 'Disc 2', etc.\n- Compatible : Fonctionne avec la plupart des émulateurs gérant le changement de disque.",
    "EN": "M3UCreator automates the management of your multi-disc games (PS1, Dreamcast...).\n\nFeatures:\n- Auto Playlist: Generates an .m3u file for each game consisting of multiple CDs (.bin/.cue, .iso...).\n- Visual Cleanup: Allows showing only a single entry per game in your frontend (RetroBat, ES).\n- Intelligent: Automatically groups files named 'Disc 1', 'Disc 2', etc.\n- Compatible: Works with most emulators handling disc swapping.",
    "DE": "M3UCreator automatisiert die Verwaltung Ihrer Multi-Disc-Spiele (PS1, Dreamcast...).\n\nFunktionen:\n- Auto-Playlist: Generiert eine .m3u-Datei für jedes Spiel, das aus mehreren CDs besteht (.bin/.cue, .iso...).\n- Visuelle Bereinigung: Ermöglicht das Anzeigen nur eines Eintrags pro Spiel in Ihrem Frontend (RetroBat, ES).\n- Intelligent: Gruppiert automatisch Dateien mit den Namen 'Disc 1', 'Disc 2' usw.\n- Kompatibel: Funktioniert mit den meisten Emulatoren, die Disc-Wechsel unterstützen.",
    "ES": "M3UCreator automatiza la gestión de tus juegos multi-disco (PS1, Dreamcast...).\n\nFuncionalidades:\n- Playlist Auto: Genera un archivo .m3u para cada juego compuesto de varios CD (.bin/.cue, .iso...).\n- Limpieza Visual: Permite mostrar una sola entrada por juego en tu frontend (RetroBat, ES).\n- Inteligente: Agrupa automáticamente los archivos llamados 'Disc 1', 'Disc 2', etc.\n- Compatible: Funciona con la mayoría de los emuladores que gestionan el cambio de disco.",
    "IT": "M3UCreator automatizza la gestione dei tuoi giochi multi-disco (PS1, Dreamcast...).\n\nFunzionalità:\n- Playlist Auto: Genera un file .m3u per ogni gioco composto da più CD (.bin/.cue, .iso...).\n- Pulizia Visiva: Permette di mostrare una sola voce per gioco nel tuo frontend (RetroBat, ES).\n- Intelligente: Raggruppa automaticamente i file chiamati 'Disc 1', 'Disc 2', ecc.\n- Compatibile: Funziona con la maggior parte degli emulatori che gestiscono il cambio disco.",
    "PT": "M3UCreator automatiza a gestão dos seus jogos multi-disco (PS1, Dreamcast...).\n\nFuncionalidades:\n- Playlist Auto: Gera um ficheiro .m3u para cada jogo composto por vários CDs (.bin/.cue, .iso...).\n- Limpeza Visual: Permite mostrar apenas uma entrada por jogo no seu frontend (RetroBat, ES).\n- Inteligente: Agrupa automaticamente os ficheiros chamados 'Disc 1', 'Disc 2', etc.\n- Compatível: Funciona com a maioria dos emuladores que gerem a troca de disco."
  },
  "MaxCSO": {
    "FR": "MaxCSO est la référence pour la compression de vos jeux PSP et PS2.\n\nFonctionnalités :\n- Compression Extrême : Réduit la taille de vos ISO drastiquement sans perte de données (format CSO).\n- Multi-Thread : Utilise la puissance maximale de votre CPU pour une conversion rapide.\n- Optimisation : Améliore les temps de chargement sur certaines configurations (moins de données à lire).\n- Réversible : Permet de décompresser le CSO en ISO si besoin.",
    "EN": "MaxCSO is the benchmark for compressing your PSP and PS2 games.\n\nFeatures:\n- Extreme Compression: Drastically reduces ISO size without data loss (CSO format).\n- Multi-Thread: Uses maximum CPU power for fast conversion.\n- Optimization: Improves loading times on some configurations (less data to read).\n- Reversible: Allows decompressing CSO to ISO if needed.",
    "DE": "MaxCSO ist die Referenz für die Komprimierung Ihrer PSP- und PS2-Spiele.\n\nFunktionen:\n- Extreme Komprimierung: Reduziert die ISO-Größe drastisch ohne Datenverlust (CSO-Format).\n- Multi-Thread: Nutzt die maximale CPU-Leistung für eine schnelle Konvertierung.\n- Optimierung: Verbessert die Ladezeiten bei einigen Konfigurationen (weniger Daten zu lesen).\n- Reversibel: Ermöglicht bei Bedarf das Dekomprimieren von CSO in ISO.",
    "ES": "MaxCSO es la referencia para la compresión de tus juegos PSP y PS2.\n\nFuncionalidades:\n- Compresión Extrema: Reduce el tamaño de tus ISO drásticamente sin pérdida de datos (formato CSO).\n- Multi-Hilo: Utiliza la potencia máxima de tu CPU para una conversión rápida.\n- Optimización: Mejora los tiempos de carga en algunas configuraciones (menos datos a leer).\n- Reversible: Permite descomprimir el CSO a ISO si es necesario.",
    "IT": "MaxCSO è il riferimento per la compressione dei tuoi giochi PSP e PS2.\n\nFunzionalità:\n- Compressione Estrema: Riduce drasticamente la dimensione delle ISO senza perdita di dati (formato CSO).\n- Multi-Thread: Utilizza la massima potenza della CPU per una conversione rapida.\n- Ottimizzazione: Migliora i tempi di caricamento su alcune configurazioni (meno dati da leggere).\n- Reversibile: Permette di decomprimere il CSO in ISO se necessario.",
    "PT": "MaxCSO é a referência para a compressão dos seus jogos PSP e PS2.\n\nFuncionalidades:\n- Compressão Extrema: Reduz o tamanho dos seus ISO drasticamente sem perda de dados (formato CSO).\n- Multi-Thread: Utiliza a potência máxima do seu CPU para uma conversão rápida.\n- Otimização: Melhora os tempos de carregamento em algumas configurações (menos dados para ler).\n- Reversível: Permite descomprimir o CSO em ISO se necessário."
  },
  "MediaOrphans": {
    "FR": "MediaOrphans fait le ménage dans vos dossiers médias (Images, Vidéos).\n\nFonctionnalités :\n- Détective : Identifie les images/vidéos qui ne correspondent à aucun jeu existant (Orphelins).\n- Manquants : Repère à l'inverse les jeux qui n'ont pas encore d'image ou de vidéo.\n- Nettoyage : Permet de supprimer les médias inutiles pour gagner de la place.\n- Rapport : Fournit un état des lieux précis de la complétion de votre scraping.",
    "EN": "MediaOrphans cleans up your media folders (Images, Videos).\n\nFeatures:\n- Detective: Identifies images/videos that do not correspond to any existing game (Orphans).\n- Missing: Conversley spots games that do not yet have an image or video.\n- Cleanup: Allows deleting unnecessary media to save space.\n- Report: Provides a precise status of your scraping completion.",
    "DE": "MediaOrphans räumt in Ihren Medienordnern (Bilder, Videos) auf.\n\nFunktionen:\n- Detektiv: Identifiziert Bilder/Videos, die keinem existierenden Spiel entsprechen (Waisen).\n- Fehlend: Findet umgekehrt Spiele, die noch kein Bild oder Video haben.\n- Bereinigung: Ermöglicht das Löschen unnötiger Medien, um Platz zu sparen.\n- Bericht: Liefert einen genauen Status Ihrer Scraping-Vollständigkeit.",
    "ES": "MediaOrphans limpia tus carpetas de medios (Imágenes, Videos).\n\nFuncionalidades:\n- Detective: Identifica las imágenes/videos que no corresponden a ningún juego existente (Huérfanos).\n- Faltantes: Detecta a la inversa los juegos que aún no tienen imagen o video.\n- Limpieza: Permite eliminar los medios innecesarios para ahorrar espacio.\n- Informe: Proporciona un estado preciso de la finalización de tu scraping.",
    "IT": "MediaOrphans fa pulizia nelle tue cartelle media (Immagini, Video).\n\nFunzionalità:\n- Detective: Identifica le immagini/video che non corrispondono ad alcun gioco esistente (Orfani).\n- Mancanti: Individua al contrario i giochi che non hanno ancora un'immagine o un video.\n- Pulizia: Permette di eliminare i media inutili per risparmiare spazio.\n- Rapporto: Fornisce uno stato preciso del completamento del tuo scraping.",
    "PT": "MediaOrphans faz a limpeza nas suas pastas de multimédia (Imagens, Vídeos).\n\nFuncionalidades:\n- Detetive: Identifica imagens/vídeos que não correspondem a nenhum jogo existente (Órfãos).\n- Em Falta: Deteta, pelo contrário, jogos que ainda não têm imagem ou vídeo.\n- Limpeza: Permite eliminar ficheiros multimédia inúteis para poupar espaço.\n- Relatório: Fornece um estado preciso da conclusão do seu scraping."
  }
}